-- MySQL dump 10.13  Distrib 5.5.41, for debian-linux-gnu (x86_64)
--
-- Host: localhost    Database: nskps
-- ------------------------------------------------------
-- Server version	5.5.41-0+wheezy1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `articles`
--

DROP TABLE IF EXISTS `articles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `articles` (
  `type` int(11) NOT NULL,
  `name` varchar(64) NOT NULL,
  `date` datetime NOT NULL,
  `autor` int(11) NOT NULL,
  `changed` datetime NOT NULL,
  `changeautor` int(11) DEFAULT NULL,
  `text` text NOT NULL,
  `img_ext` varchar(4) NOT NULL,
  UNIQUE KEY `name` (`name`),
  KEY `date` (`date`),
  KEY `autor` (`autor`),
  KEY `changed` (`changed`),
  KEY `changeautor` (`changeautor`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `articles`
--

LOCK TABLES `articles` WRITE;
/*!40000 ALTER TABLE `articles` DISABLE KEYS */;
/*!40000 ALTER TABLE `articles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `asterisk_cdr`
--

DROP TABLE IF EXISTS `asterisk_cdr`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `asterisk_cdr` (
  `calldate` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `clid` varchar(80) NOT NULL DEFAULT '',
  `src` varchar(80) NOT NULL DEFAULT '',
  `dst` varchar(80) NOT NULL DEFAULT '',
  `dcontext` varchar(80) NOT NULL DEFAULT '',
  `channel` varchar(80) NOT NULL DEFAULT '',
  `dstchannel` varchar(80) NOT NULL DEFAULT '',
  `lastapp` varchar(80) NOT NULL DEFAULT '',
  `lastdata` varchar(80) NOT NULL DEFAULT '',
  `duration` int(11) NOT NULL DEFAULT '0',
  `billsec` int(11) NOT NULL DEFAULT '0',
  `disposition` varchar(45) NOT NULL DEFAULT '',
  `amaflags` int(11) NOT NULL DEFAULT '0',
  `accountcode` varchar(20) NOT NULL DEFAULT '',
  `userfield` varchar(255) NOT NULL DEFAULT ''
) ENGINE=MyISAM DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `asterisk_cdr`
--

LOCK TABLES `asterisk_cdr` WRITE;
/*!40000 ALTER TABLE `asterisk_cdr` DISABLE KEYS */;
/*!40000 ALTER TABLE `asterisk_cdr` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `asterisk_queue_log`
--

DROP TABLE IF EXISTS `asterisk_queue_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `asterisk_queue_log` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `time` char(26) DEFAULT NULL,
  `callid` varchar(32) NOT NULL DEFAULT '',
  `queuename` varchar(32) NOT NULL DEFAULT '',
  `agent` varchar(32) NOT NULL DEFAULT '',
  `event` varchar(32) NOT NULL DEFAULT '',
  `data1` char(20) DEFAULT NULL,
  `data2` char(20) DEFAULT NULL,
  `data3` char(20) DEFAULT NULL,
  `data4` char(20) DEFAULT NULL,
  `data5` char(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `asterisk_queue_log`
--

LOCK TABLES `asterisk_queue_log` WRITE;
/*!40000 ALTER TABLE `asterisk_queue_log` DISABLE KEYS */;
/*!40000 ALTER TABLE `asterisk_queue_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `async_workers_tasks`
--

DROP TABLE IF EXISTS `async_workers_tasks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `async_workers_tasks` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `task` varchar(32) NOT NULL,
  `description` varchar(128) NOT NULL,
  `needrun` tinyint(4) NOT NULL DEFAULT '1',
  `textstatus` varchar(128) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `needrun` (`needrun`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `async_workers_tasks`
--

LOCK TABLES `async_workers_tasks` WRITE;
/*!40000 ALTER TABLE `async_workers_tasks` DISABLE KEYS */;
/*!40000 ALTER TABLE `async_workers_tasks` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `attachments`
--

DROP TABLE IF EXISTS `attachments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `attachments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `original_filename` varchar(64) NOT NULL,
  `comment` varchar(256) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `attachments`
--

LOCK TABLES `attachments` WRITE;
/*!40000 ALTER TABLE `attachments` DISABLE KEYS */;
/*!40000 ALTER TABLE `attachments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `class_country`
--

DROP TABLE IF EXISTS `class_country`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `class_country` (
  `id` int(6) NOT NULL AUTO_INCREMENT COMMENT 'pk',
  `name` varchar(255) NOT NULL COMMENT 'Наименование страны',
  `full_name` varchar(255) DEFAULT NULL COMMENT 'Полное наименование страны',
  `number_code` varchar(4) NOT NULL COMMENT 'Числовой код',
  `alfa2` varchar(2) NOT NULL COMMENT 'Код альфа-2',
  `alfa3` varchar(3) NOT NULL COMMENT 'Код альфа-3',
  `visible` tinyint(4) NOT NULL DEFAULT '1' COMMENT 'Видимость',
  `comment` varchar(255) DEFAULT NULL COMMENT 'Комментарий',
  PRIMARY KEY (`id`),
  UNIQUE KEY `number_code` (`number_code`),
  UNIQUE KEY `alfa2` (`alfa2`),
  UNIQUE KEY `alfa3` (`alfa3`)
) ENGINE=InnoDB AUTO_INCREMENT=249 DEFAULT CHARSET=utf8 COMMENT='Общероссийский классификатор стран мира ОКСМ';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `class_country`
--

LOCK TABLES `class_country` WRITE;
/*!40000 ALTER TABLE `class_country` DISABLE KEYS */;
INSERT INTO `class_country` VALUES (1,'АФГАНИСТАН','Переходное Исламское Государство Афганистан','004','AF','AFG',1,NULL),(2,'АЛБАНИЯ','Республика Албания','008','AL','ALB',1,NULL),(3,'АНТАРКТИДА',NULL,'010','AQ','ATA',1,NULL),(4,'АЛЖИР','Алжирская Народная Демократическая Республика','012','DZ','DZA',1,NULL),(5,'АМЕРИКАНСКОЕ САМОА',NULL,'016','AS','ASM',1,NULL),(6,'АНДОРРА','Княжество Андорра','020','AD','AND',1,NULL),(7,'АНГОЛА','Республика Ангола','024','AO','AGO',1,NULL),(8,'АНТИГУА И БАРБУДА',NULL,'028','AG','ATG',1,NULL),(9,'АЗЕРБАЙДЖАН','Республика Азербайджан','031','AZ','AZE',1,NULL),(10,'АРГЕНТИНА','Аргентинская Республика','032','AR','ARG',1,NULL),(11,'АВСТРАЛИЯ',NULL,'036','AU','AUS',1,NULL),(12,'АВСТРИЯ','Австрийская Республика','040','AT','AUT',1,NULL),(13,'БАГАМЫ','Содружество Багамы','044','BS','BHS',1,NULL),(14,'БАХРЕЙН','Королевство Бахрейн','048','BH','BHR',1,NULL),(15,'БАНГЛАДЕШ','Народная Республика Бангладеш','050','BD','BGD',1,NULL),(16,'АРМЕНИЯ','Республика Армения','051','AM','ARM',1,NULL),(17,'БАРБАДОС',NULL,'052','BB','BRB',1,NULL),(18,'БЕЛЬГИЯ','Королевство Бельгии','056','BE','BEL',1,NULL),(19,'БЕРМУДЫ',NULL,'060','BM','BMU',1,NULL),(20,'БУТАН','Королевство Бутан','064','BT','BTN',1,NULL),(21,'БОЛИВИЯ, МНОГОНАЦИОНАЛЬНОЕ ГОСУДАРСТВО','Многонациональное Государство Боливия','068','BO','BOL',1,NULL),(22,'БОСНИЯ И ГЕРЦЕГОВИНА',NULL,'070','BA','BIH',1,NULL),(23,'БОТСВАНА','Республика Ботсвана','072','BW','BWA',1,NULL),(24,'ОСТРОВ БУВЕ',NULL,'074','BV','BVT',1,NULL),(25,'БРАЗИЛИЯ','Федеративная Республика Бразилия','076','BR','BRA',1,NULL),(26,'БЕЛИЗ',NULL,'084','BZ','BLZ',1,NULL),(27,'БРИТАНСКАЯ ТЕРРИТОРИЯ В ИНДИЙСКОМ ОКЕАНЕ',NULL,'086','IO','IOT',1,NULL),(28,'СОЛОМОНОВЫ ОСТРОВА',NULL,'090','SB','SLB',1,NULL),(29,'ВИРГИНСКИЕ ОСТРОВА, БРИТАНСКИЕ','Британские Виргинские острова','092','VG','VGB',1,NULL),(30,'БРУНЕЙ-ДАРУССАЛАМ',NULL,'096','BN','BRN',1,NULL),(31,'БОЛГАРИЯ','Республика Болгария','100','BG','BGR',1,NULL),(32,'МЬЯНМА','Союз Мьянма','104','MM','MMR',1,NULL),(33,'БУРУНДИ','Республика Бурунди','108','BI','BDI',1,NULL),(34,'БЕЛАРУСЬ','Республика Беларусь','112','BY','BLR',1,NULL),(35,'КАМБОДЖА','Королевство Камбоджа','116','KH','KHM',1,NULL),(36,'КАМЕРУН','Республика Камерун','120','CM','CMR',1,NULL),(37,'КАНАДА',NULL,'124','CA','CAN',1,NULL),(38,'КАБО-ВЕРДЕ','Республика Кабо-Верде','132','CV','CPV',1,NULL),(39,'ОСТРОВА КАЙМАН',NULL,'136','KY','CYM',1,NULL),(40,'ЦЕНТРАЛЬНО-АФРИКАНСКАЯ РЕСПУБЛИКА',NULL,'140','CF','CAF',1,NULL),(41,'ШРИ-ЛАНКА','Демократическая Социалистическая Республика Шри-Ланка','144','LK','LKA',1,NULL),(42,'ЧАД','Республика Чад','148','TD','TCD',1,NULL),(43,'ЧИЛИ','Республика Чили','152','CL','CHL',1,NULL),(44,'КИТАЙ','Китайская Народная Республика','156','CN','CHN',1,NULL),(45,'ТАЙВАНЬ (КИТАЙ)',NULL,'158','TW','TWN',1,NULL),(46,'ОСТРОВ РОЖДЕСТВА',NULL,'162','CX','CXR',1,NULL),(47,'КОКОСОВЫЕ (КИЛИНГ) ОСТРОВА',NULL,'166','CC','CCK',1,NULL),(48,'КОЛУМБИЯ','Республика Колумбия','170','CO','COL',1,NULL),(49,'КОМОРЫ','Союз Коморы','174','KM','COM',1,NULL),(50,'МАЙОТТА',NULL,'175','YT','MYT',1,NULL),(51,'КОНГО','Республика Конго','178','CG','COG',1,NULL),(52,'КОНГО, ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА','Демократическая Республика Конго','180','CD','COD',1,NULL),(53,'ОСТРОВА КУКА',NULL,'184','CK','COK',1,NULL),(54,'КОСТА-РИКА','Республика Коста-Рика','188','CR','CRI',1,NULL),(55,'ХОРВАТИЯ','Республика Хорватия','191','HR','HRV',1,NULL),(56,'КУБА','Республика Куба','192','CU','CUB',1,NULL),(57,'КИПР','Республика Кипр','196','CY','CYP',1,NULL),(58,'ЧЕШСКАЯ РЕСПУБЛИКА',NULL,'203','CZ','CZE',1,NULL),(59,'БЕНИН','Республика Бенин','204','BJ','BEN',1,NULL),(60,'ДАНИЯ','Королевство Дания','208','DK','DNK',1,NULL),(61,'ДОМИНИКА','Содружество Доминики','212','DM','DMA',1,NULL),(62,'ДОМИНИКАНСКАЯ РЕСПУБЛИКА',NULL,'214','DO','DOM',1,NULL),(63,'ЭКВАДОР','Республика Эквадор','218','EC','ECU',1,NULL),(64,'ЭЛЬ-САЛЬВАДОР','Республика Эль-Сальвадор','222','SV','SLV',1,NULL),(65,'ЭКВАТОРИАЛЬНАЯ ГВИНЕЯ','Республика Экваториальная Гвинея','226','GQ','GNQ',1,NULL),(66,'ЭФИОПИЯ','Федеративная Демократическая Республика Эфиопия','231','ET','ETH',1,NULL),(67,'ЭРИТРЕЯ',NULL,'232','ER','ERI',1,NULL),(68,'ЭСТОНИЯ','Эстонская Республика','233','EE','EST',1,NULL),(69,'ФАРЕРСКИЕ ОСТРОВА',NULL,'234','FO','FRO',1,NULL),(70,'ФОЛКЛЕНДСКИЕ ОСТРОВА (МАЛЬВИНСКИЕ)',NULL,'238','FK','FLK',1,NULL),(71,'ЮЖНАЯ ДЖОРДЖИЯ И ЮЖНЫЕ САНДВИЧЕВЫ ОСТРОВА',NULL,'239','GS','SGS',1,NULL),(72,'ФИДЖИ','Республика Островов Фиджи','242','FJ','FJI',1,NULL),(73,'ФИНЛЯНДИЯ','Финляндская Республика','246','FI','FIN',1,NULL),(74,'ЭЛАНДСКИЕ ОСТРОВА',NULL,'248','АХ','ALA',1,NULL),(75,'ФРАНЦИЯ','Французская Республика','250','FR','FRA',1,NULL),(76,'ФРАНЦУЗСКАЯ ГВИАНА',NULL,'254','GF','GUF',1,NULL),(77,'ФРАНЦУЗСКАЯ ПОЛИНЕЗИЯ',NULL,'258','PF','PYF',1,NULL),(78,'ФРАНЦУЗСКИЕ ЮЖНЫЕ ТЕРРИТОРИИ',NULL,'260','TF','ATF',1,NULL),(79,'ДЖИБУТИ','Республика Джибути','262','DJ','DJI',1,NULL),(80,'ГАБОН','Габонская Республика','266','GA','GAB',1,NULL),(81,'ГРУЗИЯ',NULL,'268','GE','GEO',1,NULL),(82,'ГАМБИЯ','Республика Гамбия','270','GM','GMB',1,NULL),(83,'ПАЛЕСТИНСКАЯ ТЕРРИТОРИЯ, ОККУПИРОВАННАЯ','Оккупированная Палестинская территория','275','PS','PSE',1,NULL),(84,'ГЕРМАНИЯ','Федеративная Республика Германия','276','DE','DEU',1,NULL),(85,'ГАНА','Республика Гана','288','GH','GHA',1,NULL),(86,'ГИБРАЛТАР',NULL,'292','GI','GIB',1,NULL),(87,'КИРИБАТИ','Республика Кирибати','296','KI','KIR',1,NULL),(88,'ГРЕЦИЯ','Греческая Республика','300','GR','GRC',1,NULL),(89,'ГРЕНЛАНДИЯ',NULL,'304','GL','GRL',1,NULL),(90,'ГРЕНАДА',NULL,'308','GD','GRD',1,NULL),(91,'ГВАДЕЛУПА',NULL,'312','GP','GLP',1,NULL),(92,'ГУАМ',NULL,'316','GU','GUM',1,NULL),(93,'ГВАТЕМАЛА','Республика Гватемала','320','GT','GTM',1,NULL),(94,'ГВИНЕЯ','Гвинейская Республика','324','GN','GIN',1,NULL),(95,'ГАЙАНА','Республика Гайана','328','GY','GUY',1,NULL),(96,'ГАИТИ','Республика Гаити','332','HT','HTI',1,NULL),(97,'ОСТРОВ ХЕРД И ОСТРОВА МАКДОНАЛЬД',NULL,'334','HM','HMD',1,NULL),(98,'ПАПСКИЙ ПРЕСТОЛ (ГОСУДАРСТВО - ГОРОД ВАТИКАН)',NULL,'336','VA','VAT',1,NULL),(99,'ГОНДУРАС','Республика Гондурас','340','HN','HND',1,NULL),(100,'ГОНКОНГ','Специальный административный регион Китая Гонконг','344','HK','HKG',1,NULL),(101,'ВЕНГРИЯ','Венгерская Республика','348','HU','HUN',1,NULL),(102,'ИСЛАНДИЯ','Республика Исландия','352','IS','ISL',1,NULL),(103,'ИНДИЯ','Республика Индия','356','IN','IND',1,NULL),(104,'ИНДОНЕЗИЯ','Республика Индонезия','360','ID','IDN',1,NULL),(105,'ИРАН, ИСЛАМСКАЯ РЕСПУБЛИКА','Исламская Республика Иран','364','IR','IRN',1,NULL),(106,'ИРАК','Республика Ирак','368','IQ','IRQ',1,NULL),(107,'ИРЛАНДИЯ',NULL,'372','IE','IRL',1,NULL),(108,'ИЗРАИЛЬ','Государство Израиль','376','IL','ISR',1,NULL),(109,'ИТАЛИЯ','Итальянская Республика','380','IT','ITA',1,NULL),(110,'КОТ Д\'ИВУАР','Республика Кот д\'Ивуар','384','CI','CIV',1,NULL),(111,'ЯМАЙКА',NULL,'388','JM','JAM',1,NULL),(112,'ЯПОНИЯ',NULL,'392','JP','JPN',1,NULL),(113,'КАЗАХСТАН','Республика Казахстан','398','KZ','KAZ',1,NULL),(114,'ИОРДАНИЯ','Иорданское Хашимитское Королевство','400','JO','JOR',1,NULL),(115,'КЕНИЯ','Республика Кения','404','KE','KEN',1,NULL),(116,'КОРЕЯ, НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА','Корейская Народно-Демократическая Республика','408','KP','PRK',1,NULL),(117,'КОРЕЯ, РЕСПУБЛИКА','Республика Корея','410','KR','KOR',1,NULL),(118,'КУВЕЙТ','Государство Кувейт','414','KW','KWT',1,NULL),(119,'КИРГИЗИЯ','Киргизская Республика','417','KG','KGZ',1,NULL),(120,'ЛАОССКАЯ НАРОДНО-ДЕМОКРАТИЧЕСКАЯ РЕСПУБЛИКА',NULL,'418','LA','LAO',1,NULL),(121,'ЛИВАН','Ливанская Республика','422','LB','LBN',1,NULL),(122,'ЛЕСОТО','Королевство Лесото','426','LS','LSO',1,NULL),(123,'ЛАТВИЯ','Латвийская Республика','428','LV','LVA',1,NULL),(124,'ЛИБЕРИЯ','Республика Либерия','430','LR','LBR',1,NULL),(125,'ЛИВИЙСКАЯ АРАБСКАЯ ДЖАМАХИРИЯ','Социалистическая Народная Ливийская Арабская Джамахирия','434','LY','LBY',1,NULL),(126,'ЛИХТЕНШТЕЙН','Княжество Лихтенштейн','438','LI','LIE',1,NULL),(127,'ЛИТВА','Литовская Республика','440','LT','LTU',1,NULL),(128,'ЛЮКСЕМБУРГ','Великое Герцогство Люксембург','442','LU','LUX',1,NULL),(129,'МАКАО','Специальный административный регион Китая Макао','446','MO','MAC',1,NULL),(130,'МАДАГАСКАР','Республика Мадагаскар','450','MG','MDG',1,NULL),(131,'МАЛАВИ','Республика Малави','454','MW','MWI',1,NULL),(132,'МАЛАЙЗИЯ',NULL,'458','MY','MYS',1,NULL),(133,'МАЛЬДИВЫ','Мальдивская Республика','462','MV','MDV',1,NULL),(134,'МАЛИ','Республика Мали','466','ML','MLI',1,NULL),(135,'МАЛЬТА','Республика Мальта','470','MT','MLT',1,NULL),(136,'МАРТИНИКА',NULL,'474','MQ','MTQ',1,NULL),(137,'МАВРИТАНИЯ','Исламская Республика Мавритания','478','MR','MRT',1,NULL),(138,'МАВРИКИЙ','Республика Маврикий','480','MU','MUS',1,NULL),(139,'МЕКСИКА','Мексиканские Соединенные Штаты','484','MX','MEX',1,NULL),(140,'МОНАКО','Княжество Монако','492','MC','MCO',1,NULL),(141,'МОНГОЛИЯ',NULL,'496','MN','MNG',1,NULL),(142,'МОЛДОВА, РЕСПУБЛИКА','Республика Молдова','498','MD','MDA',1,NULL),(143,'ЧЕРНОГОРИЯ',NULL,'499','ME','MNE',1,NULL),(144,'МОНТСЕРРАТ',NULL,'500','MS','MSR',1,NULL),(145,'МАРОККО','Королевство Марокко','504','MA','MAR',1,NULL),(146,'МОЗАМБИК','Республика Мозамбик','508','MZ','MOZ',1,NULL),(147,'ОМАН','Султанат Оман','512','OM','OMN',1,NULL),(148,'НАМИБИЯ','Республика Намибия','516','NA','NAM',1,NULL),(149,'НАУРУ','Республика Науру','520','NR','NRU',1,NULL),(150,'НЕПАЛ','Федеративная Демократическая Республика Непал','524','NP','NPL',1,NULL),(151,'НИДЕРЛАНДЫ','Королевство Нидерландов','528','NL','NLD',1,NULL),(152,'НИДЕРЛАНДСКИЕ АНТИЛЫ',NULL,'530','AN','ANT',1,NULL),(153,'АРУБА',NULL,'533','AW','ABW',1,NULL),(154,'НОВАЯ КАЛЕДОНИЯ',NULL,'540','NC','NCL',1,NULL),(155,'ВАНУАТУ','Республика Вануату','548','VU','VUT',1,NULL),(156,'НОВАЯ ЗЕЛАНДИЯ',NULL,'554','NZ','NZL',1,NULL),(157,'НИКАРАГУА','Республика Никарагуа','558','NI','NIC',1,NULL),(158,'НИГЕР','Республика Нигер','562','NE','NER',1,NULL),(159,'НИГЕРИЯ','Федеративная Республика Нигерия','566','NG','NGA',1,NULL),(160,'НИУЭ','Республика Ниуэ','570','NU','NIU',1,NULL),(161,'ОСТРОВ НОРФОЛК',NULL,'574','NF','NFK',1,NULL),(162,'НОРВЕГИЯ','Королевство Норвегия','578','NO','NOR',1,NULL),(163,'СЕВЕРНЫЕ МАРИАНСКИЕ ОСТРОВА','Содружество Северных Марианских островов','580','MP','MNP',1,NULL),(164,'МАЛЫЕ ТИХООКЕАНСКИЕ ОТДАЛЕННЫЕ ОСТРОВА СОЕДИНЕННЫХ ШТАТОВ',NULL,'581','UM','UMI',1,NULL),(165,'МИКРОНЕЗИЯ, ФЕДЕРАТИВНЫЕ ШТАТЫ','Федеративные штаты Микронезии','583','FM','FSM',1,NULL),(166,'МАРШАЛЛОВЫ ОСТРОВА','Республика Маршалловы Острова','584','MH','MHL',1,NULL),(167,'ПАЛАУ','Республика Палау','585','PW','PLW',1,NULL),(168,'ПАКИСТАН','Исламская Республика Пакистан','586','PK','PAK',1,NULL),(169,'ПАНАМА','Республика Панама','591','PA','PAN',1,NULL),(170,'ПАПУА-НОВАЯ ГВИНЕЯ',NULL,'598','PG','PNG',1,NULL),(171,'ПАРАГВАЙ','Республика Парагвай','600','PY','PRY',1,NULL),(172,'ПЕРУ','Республика Перу','604','PE','PER',1,NULL),(173,'ФИЛИППИНЫ','Республика Филиппины','608','PH','PHL',1,NULL),(174,'ПИТКЕРН',NULL,'612','PN','PCN',1,NULL),(175,'ПОЛЬША','Республика Польша','616','PL','POL',1,NULL),(176,'ПОРТУГАЛИЯ','Португальская Республика','620','PT','PRT',1,NULL),(177,'ГВИНЕЯ-БИСАУ','Республика Гвинея-Бисау','624','GW','GNB',1,NULL),(178,'ТИМОР-ЛЕСТЕ','Демократическая Республика Тимор-Лесте','626','TL','TLS',1,NULL),(179,'ПУЭРТО-РИКО',NULL,'630','PR','PRI',1,NULL),(180,'КАТАР','Государство Катар','634','QA','QAT',1,NULL),(181,'РЕЮНЬОН',NULL,'638','RE','REU',1,NULL),(182,'РУМЫНИЯ',NULL,'642','RO','ROU',1,NULL),(183,'РОССИЯ','Российская Федерация','643','RU','RUS',1,NULL),(184,'РУАНДА','Руандийская Республика','646','RW','RWA',1,NULL),(185,'СЕН-БАРТЕЛЕМИ',NULL,'652','BL','BLM',1,NULL),(186,'СВЯТАЯ ЕЛЕНА',NULL,'654','SH','SHN',1,NULL),(187,'СЕНТ-КИТС И НЕВИС',NULL,'659','KN','KNA',1,NULL),(188,'АНГИЛЬЯ',NULL,'660','AI','AIA',1,NULL),(189,'СЕНТ-ЛЮСИЯ',NULL,'662','LC','LCA',1,NULL),(190,'СЕН-МАРТЕН',NULL,'663','MF','MAF',1,NULL),(191,'СЕН-ПЬЕР И МИКЕЛОН',NULL,'666','PM','SPM',1,NULL),(192,'СЕНТ-ВИНСЕНТ И ГРЕНАДИНЫ',NULL,'670','VC','VCT',1,NULL),(193,'САН-МАРИНО','Республика Сан-Марино','674','SM','SMR',1,NULL),(194,'САН-ТОМЕ И ПРИНСИПИ','Демократическая Республика Сан-Томе и Принсипи','678','ST','STP',1,NULL),(195,'САУДОВСКАЯ АРАВИЯ','Королевство Саудовская Аравия','682','SA','SAU',1,NULL),(196,'СЕНЕГАЛ','Республика Сенегал','686','SN','SEN',1,NULL),(197,'СЕРБИЯ','Республика Сербия','688','RS','SRB',1,NULL),(198,'СЕЙШЕЛЫ','Республика Сейшелы','690','SC','SYC',1,NULL),(199,'СЬЕРРА-ЛЕОНЕ','Республика Сьерра-Леоне','694','SL','SLE',1,NULL),(200,'СИНГАПУР','Республика Сингапур','702','SG','SGP',1,NULL),(201,'СЛОВАКИЯ','Словацкая Республика','703','SK','SVK',1,NULL),(202,'ВЬЕТНАМ','Социалистическая Республика Вьетнам','704','VN','VNM',1,NULL),(203,'СЛОВЕНИЯ','Республика Словения','705','SI','SVN',1,NULL),(204,'СОМАЛИ','Сомалийская Республика','706','SO','SOM',1,NULL),(205,'ЮЖНАЯ АФРИКА','Южно-Африканская Республика','710','ZA','ZAF',1,NULL),(206,'ЗИМБАБВЕ','Республика Зимбабве','716','ZW','ZWE',1,NULL),(207,'ИСПАНИЯ','Королевство Испания','724','ES','ESP',1,NULL),(208,'ЗАПАДНАЯ САХАРА',NULL,'732','EH','ESH',1,NULL),(209,'СУДАН','Республика Судан','736','SD','SDN',1,NULL),(210,'СУРИНАМ','Республика Суринам','740','SR','SUR',1,NULL),(211,'ШПИЦБЕРГЕН И ЯН МАЙЕН',NULL,'744','SJ','SJM',1,NULL),(212,'СВАЗИЛЕНД','Королевство Свазиленд','748','SZ','SWZ',1,NULL),(213,'ШВЕЦИЯ','Королевство Швеция','752','SE','SWE',1,NULL),(214,'ШВЕЙЦАРИЯ','Швейцарская Конфедерация','756','CH','CHE',1,NULL),(215,'СИРИЙСКАЯ АРАБСКАЯ РЕСПУБЛИКА',NULL,'760','SY','SYR',1,NULL),(216,'ТАДЖИКИСТАН','Республика Таджикистан','762','TJ','TJK',1,NULL),(217,'ТАИЛАНД','Королевство Таиланд','764','TH','THA',1,NULL),(218,'ТОГО','Тоголезская Республика','768','TG','TGO',1,NULL),(219,'ТОКЕЛАУ',NULL,'772','TK','TKL',1,NULL),(220,'ТОНГА','Королевство Тонга','776','TO','TON',1,NULL),(221,'ТРИНИДАД И ТОБАГО','Республика Тринидад и Тобаго','780','TT','TTO',1,NULL),(222,'ОБЪЕДИНЕННЫЕ АРАБСКИЕ ЭМИРАТЫ',NULL,'784','AE','ARE',1,NULL),(223,'ТУНИС','Тунисская Республика','788','TN','TUN',1,NULL),(224,'ТУРЦИЯ','Турецкая Республика','792','TR','TUR',1,NULL),(225,'ТУРКМЕНИЯ','Туркменистан','795','TM','TKM',1,NULL),(226,'ОСТРОВА ТЕРКС И КАЙКОС',NULL,'796','TC','TCA',1,NULL),(227,'ТУВАЛУ',NULL,'798','TV','TUV',1,NULL),(228,'УГАНДА','Республика Уганда','800','UG','UGA',1,NULL),(229,'УКРАИНА',NULL,'804','UA','UKR',1,NULL),(230,'РЕСПУБЛИКА МАКЕДОНИЯ',NULL,'807','MK','MKD',1,NULL),(231,'ЕГИПЕТ','Арабская Республика Египет','818','EG','EGY',1,NULL),(232,'СОЕДИНЕННОЕ КОРОЛЕВСТВО','Соединенное Королевство Великобритании и Северной Ирландии','826','GB','GBR',1,NULL),(233,'ГЕРНСИ',NULL,'831','GG','GGY',1,NULL),(234,'ДЖЕРСИ',NULL,'832','JE','JEY',1,NULL),(235,'ОСТРОВ МЭН',NULL,'833','IM','IMN',1,NULL),(236,'ТАНЗАНИЯ, ОБЪЕДИНЕННАЯ РЕСПУБЛИКА','Объединенная Республика Танзания','834','TZ','TZA',1,NULL),(237,'СОЕДИНЕННЫЕ ШТАТЫ','Соединенные Штаты Америки','840','US','USA',1,NULL),(238,'ВИРГИНСКИЕ ОСТРОВА, США','Виргинские острова Соединенных Штатов','850','VI','VIR',1,NULL),(239,'БУРКИНА-ФАСО',NULL,'854','BF','BFA',1,NULL),(240,'УРУГВАЙ','Восточная Республика Уругвай','858','UY','URY',1,NULL),(241,'УЗБЕКИСТАН','Республика Узбекистан','860','UZ','UZB',1,NULL),(242,'ВЕНЕСУЭЛА БОЛИВАРИАНСКАЯ РЕСПУБЛИКА','Боливарианская Республика Венесуэла','862','VE','VEN',1,NULL),(243,'УОЛЛИС И ФУТУНА',NULL,'876','WF','WLF',1,NULL),(244,'САМОА','Независимое Государство Самоа','882','WS','WSM',1,NULL),(245,'ЙЕМЕН','Йеменская Республика','887','YE','YEM',1,NULL),(246,'ЗАМБИЯ','Республика Замбия','894','ZM','ZMB',1,NULL),(247,'АБХАЗИЯ','Республика Абхазия','895','AB','ABH',1,NULL),(248,'ЮЖНАЯ ОСЕТИЯ','Республика Южная Осетия','896','OS','OST',1,NULL);
/*!40000 ALTER TABLE `class_country` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `class_unit`
--

DROP TABLE IF EXISTS `class_unit`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `class_unit` (
  `id` int(6) NOT NULL AUTO_INCREMENT COMMENT 'pk',
  `name` varchar(255) NOT NULL COMMENT 'Наименование единицы измерения',
  `number_code` varchar(5) NOT NULL COMMENT 'Код',
  `rus_name1` varchar(50) DEFAULT NULL COMMENT 'Условное обозначение национальное',
  `eng_name1` varchar(50) DEFAULT NULL COMMENT 'Условное обозначение международное',
  `rus_name2` varchar(50) DEFAULT NULL COMMENT 'Кодовое буквенное обозначение национальное',
  `eng_name2` varchar(50) DEFAULT NULL COMMENT 'Кодовое буквенное обозначение международное',
  `class_unit_group_id` tinyint(4) NOT NULL COMMENT 'Группа единиц измерения',
  `class_unit_type_id` tinyint(4) NOT NULL COMMENT 'Раздел/приложение в которое входит единица измерения',
  `visible` tinyint(4) NOT NULL DEFAULT '1' COMMENT 'Видимость',
  `comment` varchar(255) DEFAULT NULL COMMENT 'Комментарий',
  PRIMARY KEY (`id`),
  UNIQUE KEY `number_code` (`number_code`),
  KEY `class_unit_group_id` (`class_unit_group_id`),
  KEY `class_unit_type_id` (`class_unit_type_id`),
  CONSTRAINT `class_unit_ibfk_1` FOREIGN KEY (`class_unit_group_id`) REFERENCES `class_unit_group` (`id`),
  CONSTRAINT `class_unit_ibfk_2` FOREIGN KEY (`class_unit_type_id`) REFERENCES `class_unit_type` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=461 DEFAULT CHARSET=utf8 COMMENT='Общероссийский классификатор единиц измерения ОКЕИ';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `class_unit`
--

LOCK TABLES `class_unit` WRITE;
/*!40000 ALTER TABLE `class_unit` DISABLE KEYS */;
INSERT INTO `class_unit` VALUES (1,'Миллиметр','003','мм','mm','ММ','MMT',1,1,1,NULL),(2,'Сантиметр','004','см','cm','СМ','CMT',1,1,1,NULL),(3,'Дециметр','005','дм','dm','ДМ','DMT',1,1,1,NULL),(4,'Метр','006','м','m','М','MTR',1,1,1,NULL),(5,'Километр; тысяча метров','008','км; 10^3 м','km','КМ; ТЫС М','KMT',1,1,1,NULL),(6,'Мегаметр; миллион метров','009','Мм; 10^6 м','Mm','МЕГАМ; МЛН М','MAM',1,1,1,NULL),(7,'Дюйм (25,4 мм)','039','дюйм','in','ДЮЙМ','INH',1,1,1,NULL),(8,'Фут (0,3048 м)','041','фут','ft','ФУТ','FOT',1,1,1,NULL),(9,'Ярд (0,9144 м)','043','ярд','yd','ЯРД','YRD',1,1,1,NULL),(10,'Морская миля (1852 м)','047','миля','n mile','МИЛЬ','NMI',1,1,1,NULL),(11,'Квадратный миллиметр','050','мм2','mm2','ММ2','MMK',2,1,1,NULL),(12,'Квадратный сантиметр','051','см2','cm2','СМ2','CMK',2,1,1,NULL),(13,'Квадратный дециметр','053','дм2','dm2','ДМ2','DMK',2,1,1,NULL),(14,'Квадратный метр','055','м2','m2','М2','MTK',2,1,1,NULL),(15,'Тысяча квадратных метров','058','10^3 м^2','daa','ТЫС М2','DAA',2,1,1,NULL),(16,'Гектар','059','га','ha','ГА','HAR',2,1,1,NULL),(17,'Квадратный километр','061','км2','km2','КМ2','KMK',2,1,1,NULL),(18,'Квадратный дюйм (645,16 мм2)','071','дюйм2','in2','ДЮЙМ2','INK',2,1,1,NULL),(19,'Квадратный фут (0,092903 м2)','073','фут2','ft2','ФУТ2','FTK',2,1,1,NULL),(20,'Квадратный ярд (0,8361274 м2)','075','ярд2','yd2','ЯРД2','YDK',2,1,1,NULL),(21,'Ар (100 м2)','109','а','a','АР','ARE',2,1,1,NULL),(22,'Кубический миллиметр','110','мм3','mm3','ММ3','MMQ',3,1,1,NULL),(23,'Кубический сантиметр; миллилитр','111','см3; мл','cm3; ml','СМ3; МЛ','CMQ; MLT',3,1,1,NULL),(24,'Литр; кубический дециметр','112','л; дм3','I; L; dm^3','Л; ДМ3','LTR; DMQ',3,1,1,NULL),(25,'Кубический метр','113','м3','m3','М3','MTQ',3,1,1,NULL),(26,'Децилитр','118','дл','dl','ДЛ','DLT',3,1,1,NULL),(27,'Гектолитр','122','гл','hl','ГЛ','HLT',3,1,1,NULL),(28,'Мегалитр','126','Мл','Ml','МЕГАЛ','MAL',3,1,1,NULL),(29,'Кубический дюйм (16387,1 мм3)','131','дюйм3','in3','ДЮЙМ3','INQ',3,1,1,NULL),(30,'Кубический фут (0,02831685 м3)','132','фут3','ft3','ФУТ3','FTQ',3,1,1,NULL),(31,'Кубический ярд (0,764555 м3)','133','ярд3','yd3','ЯРД3','YDQ',3,1,1,NULL),(32,'Миллион кубических метров','159','10^6 м3','10^6 m3','МЛН М3','HMQ',3,1,1,NULL),(33,'Гектограмм','160','гг','hg','ГГ','HGM',4,1,1,NULL),(34,'Миллиграмм','161','мг','mg','МГ','MGM',4,1,1,NULL),(35,'Метрический карат','162','кар','МС','КАР','CTM',4,1,1,NULL),(36,'Грамм','163','г','g','Г','GRM',4,1,1,NULL),(37,'Килограмм','166','кг','kg','КГ','KGM',4,1,1,NULL),(38,'Тонна; метрическая тонна (1000 кг)','168','т','t','Т','TNE',4,1,1,NULL),(39,'Килотонна','170','10^3 т','kt','КТ','KTN',4,1,1,NULL),(40,'Сантиграмм','173','сг','cg','СГ','CGM',4,1,1,NULL),(41,'Брутто-регистровая тонна (2,8316 м3)','181','БРТ','-','БРУТТ. РЕГИСТР Т','GRT',4,1,1,NULL),(42,'Грузоподъемность в метрических тоннах','185','т грп','-','Т ГРУЗОПОД','CCT',4,1,1,NULL),(43,'Центнер (метрический) (100 кг); гектокилограмм; квинтал1 (метрический); децитонна','206','ц','q; 10^2 kg','Ц','DTN',4,1,1,NULL),(44,'Ватт','212','Вт','W','ВТ','WTT',5,1,1,NULL),(45,'Киловатт','214','кВт','kW','КВТ','KWT',5,1,1,NULL),(46,'Мегаватт; тысяча киловатт','215','МВт; 10^3 кВт','MW','МЕГАВТ; ТЫС КВТ','MAW',5,1,1,NULL),(47,'Вольт','222','В','V','В','VLT',5,1,1,NULL),(48,'Киловольт','223','кВ','kV','КВ','KVT',5,1,1,NULL),(49,'Киловольт-ампер','227','кВ.А','kV.A','КВ.А','KVA',5,1,1,NULL),(50,'Мегавольт-ампер (тысяча киловольт-ампер)','228','МВ.А','MV.A','МЕГАВ.А','MVA',5,1,1,NULL),(51,'Киловар','230','квар','kVAR','КВАР','KVR',5,1,1,NULL),(52,'Ватт-час','243','Вт.ч','W.h','ВТ.Ч','WHR',5,1,1,NULL),(53,'Киловатт-час','245','кВт.ч','kW.h','КВТ.Ч','KWH',5,1,1,NULL),(54,'Мегаватт-час; 1000 киловатт-часов','246','МВт.ч; 10^3 кВт.ч','МW.h','МЕГАВТ.Ч; ТЫС КВТ.Ч','MWH',5,1,1,NULL),(55,'Гигаватт-час (миллион киловатт-часов)','247','ГВт.ч','GW.h','ГИГАВТ.Ч','GWH',5,1,1,NULL),(56,'Ампер','260','А','A','А','AMP',5,1,1,NULL),(57,'Ампер-час (3,6 кКл)','263','А.ч','A.h','А.Ч','AMH',5,1,1,NULL),(58,'Тысяча ампер-часов','264','10^3 А.ч','10^3 A.h','ТЫС А.Ч','TAH',5,1,1,NULL),(59,'Кулон','270','Кл','C','КЛ','COU',5,1,1,NULL),(60,'Джоуль','271','Дж','J','ДЖ','JOU',5,1,1,NULL),(61,'Килоджоуль','273','кДж','kJ','КДЖ','KJO',5,1,1,NULL),(62,'Ом','274','Ом','<омега>','ОМ','OHM',5,1,1,NULL),(63,'Градус Цельсия','280','град. C','град. C','ГРАД ЦЕЛЬС','CEL',5,1,1,NULL),(64,'Градус Фаренгейта','281','град. F','град. F','ГРАД ФАРЕНГ','FAN',5,1,1,NULL),(65,'Кандела','282','кд','cd','КД','CDL',5,1,1,NULL),(66,'Люкс','283','лк','lx','ЛК','LUX',5,1,1,NULL),(67,'Люмен','284','лм','lm','ЛМ','LUM',5,1,1,NULL),(68,'Кельвин','288','K','K','К','KEL',5,1,1,NULL),(69,'Ньютон','289','Н','N','Н','NEW',5,1,1,NULL),(70,'Герц','290','Гц','Hz','ГЦ','HTZ',5,1,1,NULL),(71,'Килогерц','291','кГц','kHz','КГЦ','KHZ',5,1,1,NULL),(72,'Мегагерц','292','МГц','MHz','МЕГАГЦ','MHZ',5,1,1,NULL),(73,'Паскаль','294','Па','Pa','ПА','PAL',5,1,1,NULL),(74,'Сименс','296','См','S','СИ','SIE',5,1,1,NULL),(75,'Килопаскаль','297','кПа','kPa','КПА','KPA',5,1,1,NULL),(76,'Мегапаскаль','298','МПа','MPa','МЕГАПА','MPA',5,1,1,NULL),(77,'Физическая атмосфера (101325 Па)','300','атм','atm','АТМ','ATM',5,1,1,NULL),(78,'Техническая атмосфера (98066,5 Па)','301','ат','at','АТТ','ATT',5,1,1,NULL),(79,'Гигабеккерель','302','ГБк','GBq','ГИГАБК','GBQ',5,1,1,NULL),(80,'Милликюри','304','мКи','mCi','МКИ','MCU',5,1,1,NULL),(81,'Кюри','305','Ки','Ci','КИ','CUR',5,1,1,NULL),(82,'Грамм делящихся изотопов','306','г Д/И','g fissile isotopes','Г ДЕЛЯЩ ИЗОТОП','GFI',5,1,1,NULL),(83,'Миллибар','308','мб','mbar','МБАР','MBR',5,1,1,NULL),(84,'Бар','309','бар','bar','БАР','BAR',5,1,1,NULL),(85,'Гектобар','310','гб','hbar','ГБАР','HBA',5,1,1,NULL),(86,'Килобар','312','кб','kbar','КБАР','KBA',5,1,1,NULL),(87,'Фарад','314','Ф','F','Ф','FAR',5,1,1,NULL),(88,'Килограмм на кубический метр','316','кг/м3','kg/m3','КГ/М3','KMQ',5,1,1,NULL),(89,'Беккерель','323','Бк','Bq','БК','BQL',5,1,1,NULL),(90,'Вебер','324','Вб','Wb','ВБ','WEB',5,1,1,NULL),(91,'Узел (миля/ч)','327','уз','kn','УЗ','KNT',5,1,1,NULL),(92,'Метр в секунду','328','м/с','m/s','М/С','MTS',5,1,1,NULL),(93,'Оборот в секунду','330','об/с','r/s','ОБ/С','RPS',5,1,1,NULL),(94,'Оборот в минуту','331','об/мин','r/min','ОБ/МИН','RPM',5,1,1,NULL),(95,'Километр в час','333','км/ч','km/h','КМ/Ч','KMH',5,1,1,NULL),(96,'Метр на секунду в квадрате','335','м/с2','m/s2','М/С2','MSK',5,1,1,NULL),(97,'Кулон на килограмм','349','Кл/кг','C/kg','КЛ/КГ','CKG',5,1,1,NULL),(98,'Секунда','354','с','s','С','SEC',6,1,1,NULL),(99,'Минута','355','мин','min','МИН','MIN',6,1,1,NULL),(100,'Час','356','ч','h','Ч','HUR',6,1,1,NULL),(101,'Сутки','359','сут; дн','d','СУТ; ДН','DAY',6,1,1,NULL),(102,'Неделя','360','нед','-','НЕД','WEE',6,1,1,NULL),(103,'Декада','361','дек','-','ДЕК','DAD',6,1,1,NULL),(104,'Месяц','362','мес','-','МЕС','MON',6,1,1,NULL),(105,'Квартал','364','кварт','-','КВАРТ','QAN',6,1,1,NULL),(106,'Полугодие','365','полгода','-','ПОЛГОД','SAN',6,1,1,NULL),(107,'Год','366','г; лет','a','ГОД; ЛЕТ','ANN',6,1,1,NULL),(108,'Десятилетие','368','деслет','-','ДЕСЛЕТ','DEC',6,1,1,NULL),(109,'Килограмм в секунду','499','кг/с','-','КГ/С','KGS',7,1,1,NULL),(110,'Тонна пара в час','533','т пар/ч','-','Т ПАР/Ч','TSH',7,1,1,NULL),(111,'Кубический метр в секунду','596','м3/с','m3/s','М3/С','MQS',7,1,1,NULL),(112,'Кубический метр в час','598','м3/ч','m3/h','М3/Ч','MQH',7,1,1,NULL),(113,'Тысяча кубических метров в сутки','599','10^3 м3/сут','-','ТЫС М3/СУТ','TQD',7,1,1,NULL),(114,'Бобина','616','боб','-','БОБ','NBB',7,1,1,NULL),(115,'Лист','625','л.','-','ЛИСТ','LEF',7,1,1,NULL),(116,'Сто листов','626','100 л.','-','100 ЛИСТ','CLF',7,1,1,NULL),(117,'Тысяча стандартных условных кирпичей','630','тыс станд. усл. кирп','-','ТЫС СТАНД УСЛ КИРП','MBE',7,1,1,NULL),(118,'Дюжина (12 шт.)','641','дюжина','Doz; 12','ДЮЖИНА','DZN',7,1,1,NULL),(119,'Изделие','657','изд','-','ИЗД','NAR',7,1,1,NULL),(120,'Сто ящиков','683','100 ящ.','Hbx','100 ЯЩ','HBX',7,1,1,NULL),(121,'Набор','704','набор','-','НАБОР','SET',7,1,1,NULL),(122,'Пара (2 шт.)','715','пар','pr; 2','ПАР','NPR',7,1,1,NULL),(123,'Два десятка','730','20','20','2 ДЕС','SCO',7,1,1,NULL),(124,'Десять пар','732','10 пар','-','ДЕС ПАР','TPR',7,1,1,NULL),(125,'Дюжина пар','733','дюжина пар','-','ДЮЖИНА ПАР','DPR',7,1,1,NULL),(126,'Посылка','734','посыл','-','ПОСЫЛ','NPL',7,1,1,NULL),(127,'Часть','735','часть','-','ЧАСТЬ','NPT',7,1,1,NULL),(128,'Рулон','736','рул','-','РУЛ','NPL',7,1,1,NULL),(129,'Дюжина рулонов','737','дюжина рул','-','ДЮЖИНА РУЛ','DRL',7,1,1,NULL),(130,'Дюжина штук','740','дюжина шт','-','ДЮЖИНА ШТ','DPC',7,1,1,NULL),(131,'Элемент','745','элем','CI','ЭЛЕМ','NCL',7,1,1,NULL),(132,'Упаковка','778','упак','-','УПАК','NMP',7,1,1,NULL),(133,'Дюжина упаковок','780','дюжина упак','-','ДЮЖИНА УПАК','DZP',7,1,1,NULL),(134,'Сто упаковок','781','100 упак','-','100 УПАК','CNP',7,1,1,NULL),(135,'Штука','796','шт','pc; 1','ШТ','PCE; NMB',7,1,1,NULL),(136,'Сто штук','797','100 шт','100','100 ШТ','CEN',7,1,1,NULL),(137,'Тысяча штук','798','тыс. шт; 1000 шт','1000','ТЫС ШТ','MIL',7,1,1,NULL),(138,'Миллион штук','799','10^6 шт','10^6','МЛН ШТ','MIO',7,1,1,NULL),(139,'Миллиард штук','800','10^9 шт','10^9','МЛРД ШТ','MLD',7,1,1,NULL),(140,'Биллион штук (Европа); триллион штук','801','10^12 шт','10^12','БИЛЛ ШТ (ЕВР); ТРИЛЛ ШТ','BIL',7,1,1,NULL),(141,'Квинтильон штук (Европа)','802','10^18 шт','10^18','КВИНТ ШТ','TRL',7,1,1,NULL),(142,'Крепость спирта по массе','820','креп. спирта по массе','% mds','КРЕП СПИРТ ПО МАССЕ','ASM',7,1,1,NULL),(143,'Крепость спирта по объему','821','креп. спирта по объему','% vol','КРЕП СПИРТ ПО ОБЪЕМ','ASV',7,1,1,NULL),(144,'Литр чистого (100%) спирта','831','л 100% спирта','-','Л ЧИСТ СПИРТ','LPA',7,1,1,NULL),(145,'Гектолитр чистого (100%) спирта','833','Гл 100% спирта','-','ГЛ ЧИСТ СПИРТ','HPA',7,1,1,NULL),(146,'Килограмм пероксида водорода','841','кг H2О2','-','КГ ПЕРОКСИД ВОДОРОДА','-',7,1,1,NULL),(147,'Килограмм 90%-го сухого вещества','845','кг 90% с/в','-','КГ 90 ПРОЦ СУХ ВЕЩ','KSD',7,1,1,NULL),(148,'Тонна 90%-го сухого вещества','847','т 90% с/в','-','Т 90 ПРОЦ СУХ ВЕЩ','TSD',7,1,1,NULL),(149,'Килограмм оксида калия','852','кг К2О','-','КГ ОКСИД КАЛИЯ','KPO',7,1,1,NULL),(150,'Килограмм гидроксида калия','859','кг КОН','-','КГ ГИДРОКСИД КАЛИЯ','KPH',7,1,1,NULL),(151,'Килограмм азота','861','кг N','-','КГ АЗОТ','KNI',7,1,1,NULL),(152,'Килограмм гидроксида натрия','863','кг NaOH','-','КГ ГИДРОКСИД НАТРИЯ','KSH',7,1,1,NULL),(153,'Килограмм пятиокиси фосфора','865','кг Р2О5','-','КГ ПЯТИОКИСЬ ФОСФОРА','KPP',7,1,1,NULL),(154,'Килограмм урана','867','кг U','-','КГ УРАН','KUR',7,1,1,NULL),(155,'Погонный метр','018','пог. м',NULL,'ПОГ М',NULL,1,2,1,NULL),(156,'Тысяча погонных метров','019','10^3 пог. м',NULL,'ТЫС ПОГ М',NULL,1,2,1,NULL),(157,'Условный метр','020','усл. м',NULL,'УСЛ М',NULL,1,2,1,NULL),(158,'Тысяча условных метров','048','10^3 усл. м',NULL,'ТЫС УСЛ М',NULL,1,2,1,NULL),(159,'Километр условных труб','049','км усл. труб',NULL,'КМ УСЛ ТРУБ',NULL,1,2,1,NULL),(160,'Тысяча квадратных дециметров','054','10^3 дм2',NULL,'ТЫС ДМ2',NULL,2,2,1,NULL),(161,'Миллион квадратных дециметров','056','10^6 дм2',NULL,'МЛН ДМ2',NULL,2,2,1,NULL),(162,'Миллион квадратных метров','057','10^6 м2',NULL,'МЛН М2',NULL,2,2,1,NULL),(163,'Тысяча гектаров','060','10^3 га',NULL,'ТЫС ГА',NULL,2,2,1,NULL),(164,'Условный квадратный метр','062','усл. м2',NULL,'УСЛ М2',NULL,2,2,1,NULL),(165,'Тысяча условных квадратных метров','063','10^3 усл. м2',NULL,'ТЫС УСЛ М2',NULL,2,2,1,NULL),(166,'Миллион условных квадратных метров','064','10^6 усл. м2',NULL,'МЛН УСЛ М2',NULL,2,2,1,NULL),(167,'Квадратный метр общей площади','081','м2 общ. пл',NULL,'М2 ОБЩ ПЛ',NULL,2,2,1,NULL),(168,'Тысяча квадратных метров общей площади','082','10^3 м2 общ. пл',NULL,'ТЫС М2 ОБЩ ПЛ',NULL,2,2,1,NULL),(169,'Миллион квадратных метров общей площади','083','10^6 м2 общ. пл',NULL,'МЛН М2. ОБЩ ПЛ',NULL,2,2,1,NULL),(170,'Квадратный метр жилой площади','084','м2 жил. пл',NULL,'М2 ЖИЛ ПЛ',NULL,2,2,1,NULL),(171,'Тысяча квадратных метров жилой площади','085','10^3 м2 жил. пл',NULL,'ТЫС М2 ЖИЛ ПЛ',NULL,2,2,1,NULL),(172,'Миллион квадратных метров жилой площади','086','10^6 м2 жил. пл',NULL,'МЛН М2 ЖИЛ ПЛ',NULL,2,2,1,NULL),(173,'Квадратный метр учебно-лабораторных зданий','087','м2 уч. лаб. здан',NULL,'М2 УЧ.ЛАБ ЗДАН',NULL,2,2,1,NULL),(174,'Тысяча квадратных метров учебно-лабораторных зданий','088','10^3 м2 уч. лаб. здан',NULL,'ТЫС М2 УЧ. ЛАБ ЗДАН',NULL,2,2,1,NULL),(175,'Миллион квадратных метров в двухмиллиметровом исчислении','089','10^6 м2 2 мм исч',NULL,'МЛН М2 2ММ ИСЧ',NULL,2,2,1,NULL),(176,'Тысяча кубических метров','114','10^3 м3',NULL,'ТЫС М3',NULL,3,2,1,NULL),(177,'Миллиард кубических метров','115','10^9 м3',NULL,'МЛРД М3',NULL,3,2,1,NULL),(178,'Декалитр','116','дкл',NULL,'ДКЛ',NULL,3,2,1,NULL),(179,'Тысяча декалитров','119','10^3 дкл',NULL,'ТЫС ДКЛ',NULL,3,2,1,NULL),(180,'Миллион декалитров','120','10^6 дкл',NULL,'МЛН ДКЛ',NULL,3,2,1,NULL),(181,'Плотный кубический метр','121','плотн. м3',NULL,'ПЛОТН М3',NULL,3,2,1,NULL),(182,'Условный кубический метр','123','усл. м3',NULL,'УСЛ М3',NULL,3,2,1,NULL),(183,'Тысяча условных кубических метров','124','10^3 усл. м3',NULL,'ТЫС УСЛ М3',NULL,3,2,1,NULL),(184,'Миллион кубических метров переработки газа','125','10^6 м3 перераб. газа',NULL,'МЛН М3 ПЕРЕРАБ ГАЗА',NULL,3,2,1,NULL),(185,'Тысяча плотных кубических метров','127','10^3 плотн. м3',NULL,'ТЫС ПЛОТН М3',NULL,3,2,1,NULL),(186,'Тысяча полулитров','128','10^3 пол. л',NULL,'ТЫС ПОЛ Л',NULL,3,2,1,NULL),(187,'Миллион полулитров','129','10^6 пол. л',NULL,'МЛН ПОЛ Л',NULL,3,2,1,NULL),(188,'Тысяча литров; 1000 литров','130','10^3 л; 1000 л',NULL,'ТЫС Л',NULL,3,2,1,NULL),(189,'Тысяча каратов метрических','165','10^3 кар',NULL,'ТЫС КАР',NULL,4,2,1,NULL),(190,'Миллион каратов метрических','167','10^6 кар',NULL,'МЛН КАР',NULL,4,2,1,NULL),(191,'Тысяча тонн','169','10^3 т',NULL,'ТЫС Т',NULL,4,2,1,NULL),(192,'Миллион тонн','171','10^6 т',NULL,'МЛН Т',NULL,4,2,1,NULL),(193,'Тонна условного топлива','172','т усл. топл',NULL,'Т УСЛ ТОПЛ',NULL,4,2,1,NULL),(194,'Тысяча тонн условного топлива','175','10^3 т усл. топл',NULL,'ТЫС Т УСЛ ТОПЛ',NULL,4,2,1,NULL),(195,'Миллион тонн условного топлива','176','10^6 т усл. топл',NULL,'МЛН Т УСЛ ТОПЛ',NULL,4,2,1,NULL),(196,'Тысяча тонн единовременного хранения','177','10^3 т единовр. хран',NULL,'ТЫС Т ЕДИНОВР ХРАН',NULL,4,2,1,NULL),(197,'Тысяча тонн переработки','178','10^3 т перераб',NULL,'ТЫС Т ПЕРЕРАБ',NULL,4,2,1,NULL),(198,'Условная тонна','179','усл. т',NULL,'УСЛ Т',NULL,4,2,1,NULL),(199,'Тысяча центнеров','207','10^3 ц',NULL,'ТЫС Ц',NULL,4,2,1,NULL),(200,'Вольт-ампер','226','В.А',NULL,'В.А',NULL,5,2,1,NULL),(201,'Метр в час','231','м/ч',NULL,'М/Ч',NULL,5,2,1,NULL),(202,'Килокалория','232','ккал',NULL,'ККАЛ',NULL,5,2,1,NULL),(203,'Гигакалория','233','Гкал',NULL,'ГИГАКАЛ',NULL,5,2,1,NULL),(204,'Тысяча гигакалорий','234','10^3 Гкал',NULL,'ТЫС ГИГАКАЛ',NULL,5,2,1,NULL),(205,'Миллион гигакалорий','235','10^6 Гкал',NULL,'МЛН ГИГАКАЛ',NULL,5,2,1,NULL),(206,'Калория в час','236','кал/ч',NULL,'КАЛ/Ч',NULL,5,2,1,NULL),(207,'Килокалория в час','237','ккал/ч',NULL,'ККАЛ/Ч',NULL,5,2,1,NULL),(208,'Гигакалория в час','238','Гкал/ч',NULL,'ГИГАКАЛ/Ч',NULL,5,2,1,NULL),(209,'Тысяча гигакалорий в час','239','10^3 Гкал/ч',NULL,'ТЫС ГИГАКАЛ/Ч',NULL,5,2,1,NULL),(210,'Миллион ампер-часов','241','10^6 А.ч',NULL,'МЛН А.Ч',NULL,5,2,1,NULL),(211,'Миллион киловольт-ампер','242','10^6 кВ.А',NULL,'МЛН КВ.А',NULL,5,2,1,NULL),(212,'Киловольт-ампер реактивный','248','кВ.А Р',NULL,'КВ.А Р',NULL,5,2,1,NULL),(213,'Миллиард киловатт-часов','249','10^9 кВт.ч',NULL,'МЛРД КВТ.Ч',NULL,5,2,1,NULL),(214,'Тысяча киловольт-ампер реактивных','250','10^3 кВ.А Р',NULL,'ТЫС КВ.А Р',NULL,5,2,1,NULL),(215,'Лошадиная сила','251','л. с',NULL,'ЛС',NULL,5,2,1,NULL),(216,'Тысяча лошадиных сил','252','10^3 л. с',NULL,'ТЫС ЛС',NULL,5,2,1,NULL),(217,'Миллион лошадиных сил','253','10^6 л. с',NULL,'МЛН ЛС',NULL,5,2,1,NULL),(218,'Бит','254','бит',NULL,'БИТ',NULL,5,2,1,NULL),(219,'Байт','255','бай',NULL,'БАЙТ',NULL,5,2,1,NULL),(220,'Килобайт','256','кбайт',NULL,'КБАЙТ',NULL,5,2,1,NULL),(221,'Мегабайт','257','Мбайт',NULL,'МБАЙТ',NULL,5,2,1,NULL),(222,'Бод','258','бод',NULL,'БОД',NULL,5,2,1,NULL),(223,'Генри','287','Гн',NULL,'ГН',NULL,5,2,1,NULL),(224,'Тесла','313','Тл',NULL,'ТЛ',NULL,5,2,1,NULL),(225,'Килограмм на квадратный сантиметр','317','кг/см^2',NULL,'КГ/СМ2',NULL,5,2,1,NULL),(226,'Миллиметр водяного столба','337','мм вод. ст',NULL,'ММ ВОД СТ',NULL,5,2,1,NULL),(227,'Миллиметр ртутного столба','338','мм рт. ст',NULL,'ММ РТ СТ',NULL,5,2,1,NULL),(228,'Сантиметр водяного столба','339','см вод. ст',NULL,'СМ ВОД СТ',NULL,5,2,1,NULL),(229,'Микросекунда','352','мкс',NULL,'МКС',NULL,6,2,1,NULL),(230,'Миллисекунда','353','млс',NULL,'МЛС',NULL,6,2,1,NULL),(231,'Рубль','383','руб',NULL,'РУБ',NULL,7,2,1,NULL),(232,'Тысяча рублей','384','10^3 руб',NULL,'ТЫС РУБ',NULL,7,2,1,NULL),(233,'Миллион рублей','385','10^6 руб',NULL,'МЛН РУБ',NULL,7,2,1,NULL),(234,'Миллиард рублей','386','10^9 руб',NULL,'МЛРД РУБ',NULL,7,2,1,NULL),(235,'Триллион рублей','387','10^12 руб',NULL,'ТРИЛЛ РУБ',NULL,7,2,1,NULL),(236,'Квадрильон рублей','388','10^15 руб',NULL,'КВАДР РУБ',NULL,7,2,1,NULL),(237,'Пассажиро-километр','414','пасс.км',NULL,'ПАСС.КМ',NULL,7,2,1,NULL),(238,'Пассажирское место (пассажирских мест)','421','пасс. мест',NULL,'ПАСС МЕСТ',NULL,7,2,1,NULL),(239,'Тысяча пассажиро-километров','423','10^3 пасс.км',NULL,'ТЫС ПАСС.КМ',NULL,7,2,1,NULL),(240,'Миллион пассажиро-километров','424','10^6 пасс. км',NULL,'МЛН ПАСС.КМ',NULL,7,2,1,NULL),(241,'Пассажиропоток','427','пасс.поток',NULL,'ПАСС.ПОТОК',NULL,7,2,1,NULL),(242,'Тонно-километр','449','т.км',NULL,'Т.КМ',NULL,7,2,1,NULL),(243,'Тысяча тонно-километров','450','10^3 т.км',NULL,'ТЫС Т.КМ',NULL,7,2,1,NULL),(244,'Миллион тонно-километров','451','10^6 т. км',NULL,'МЛН Т.КМ',NULL,7,2,1,NULL),(245,'Тысяча наборов','479','10^3 набор',NULL,'ТЫС НАБОР',NULL,7,2,1,NULL),(246,'Грамм на киловатт-час','510','г/кВт.ч',NULL,'Г/КВТ.Ч',NULL,7,2,1,NULL),(247,'Килограмм на гигакалорию','511','кг/Гкал',NULL,'КГ/ГИГАКАЛ',NULL,7,2,1,NULL),(248,'Тонно-номер','512','т.ном',NULL,'Т.НОМ',NULL,7,2,1,NULL),(249,'Автотонна','513','авто т',NULL,'АВТО Т',NULL,7,2,1,NULL),(250,'Тонна тяги','514','т.тяги',NULL,'Т ТЯГИ',NULL,7,2,1,NULL),(251,'Дедвейт-тонна','515','дедвейт.т',NULL,'ДЕДВЕЙТ.Т',NULL,7,2,1,NULL),(252,'Тонно-танид','516','т.танид',NULL,'Т.ТАНИД',NULL,7,2,1,NULL),(253,'Человек на квадратный метр','521','чел/м2',NULL,'ЧЕЛ/М2',NULL,7,2,1,NULL),(254,'Человек на квадратный километр','522','чел/км2',NULL,'ЧЕЛ/КМ2',NULL,7,2,1,NULL),(255,'Тонна в час','534','т/ч',NULL,'Т/Ч',NULL,7,2,1,NULL),(256,'Тонна в сутки','535','т/сут',NULL,'Т/СУТ',NULL,7,2,1,NULL),(257,'Тонна в смену','536','т/смен',NULL,'Т/СМЕН',NULL,7,2,1,NULL),(258,'Тысяча тонн в сезон','537','10^3 т/сез',NULL,'ТЫС Т/СЕЗ',NULL,7,2,1,NULL),(259,'Тысяча тонн в год','538','10^3 т/год',NULL,'ТЫС Т/ГОД',NULL,7,2,1,NULL),(260,'Человеко-час','539','чел.ч',NULL,'ЧЕЛ.Ч',NULL,7,2,1,NULL),(261,'Человеко-день','540','чел.дн',NULL,'ЧЕЛ.ДН',NULL,7,2,1,NULL),(262,'Тысяча человеко-дней','541','10^3 чел.дн',NULL,'ТЫС ЧЕЛ.ДН',NULL,7,2,1,NULL),(263,'Тысяча человеко-часов','542','10^3 чел.ч',NULL,'ТЫС ЧЕЛ.Ч',NULL,7,2,1,NULL),(264,'Тысяча условных банок в смену','543','10^3 усл. банк/ смен',NULL,'ТЫС УСЛ БАНК/СМЕН',NULL,7,2,1,NULL),(265,'Миллион единиц в год','544','10^6 ед/год',NULL,'МЛН ЕД/ГОД',NULL,7,2,1,NULL),(266,'Посещение в смену','545','посещ/смен',NULL,'ПОСЕЩ/СМЕН',NULL,7,2,1,NULL),(267,'Тысяча посещений в смену','546','10^3 посещ/смен',NULL,'ТЫС ПОСЕЩ/ СМЕН',NULL,7,2,1,NULL),(268,'Пара в смену','547','пар/смен',NULL,'ПАР/СМЕН',NULL,7,2,1,NULL),(269,'Тысяча пар в смену','548','10^3 пар/смен',NULL,'ТЫС ПАР/СМЕН',NULL,7,2,1,NULL),(270,'Миллион тонн в год','550','10^6 т/год',NULL,'МЛН Т/ГОД',NULL,7,2,1,NULL),(271,'Тонна переработки в сутки','552','т перераб/сут',NULL,'Т ПЕРЕРАБ/СУТ',NULL,7,2,1,NULL),(272,'Тысяча тонн переработки в сутки','553','10^3 т перераб/ сут',NULL,'ТЫС Т ПЕРЕРАБ/СУТ',NULL,7,2,1,NULL),(273,'Центнер переработки в сутки','554','ц перераб/сут',NULL,'Ц ПЕРЕРАБ/СУТ',NULL,7,2,1,NULL),(274,'Тысяча центнеров переработки в сутки','555','10^3 ц перераб/ сут',NULL,'ТЫС Ц ПЕРЕРАБ/СУТ',NULL,7,2,1,NULL),(275,'Тысяча голов в год','556','10^3 гол/год',NULL,'ТЫС ГОЛ/ГОД',NULL,7,2,1,NULL),(276,'Миллион голов в год','557','10^6 гол/год',NULL,'МЛН ГОЛ/ГОД',NULL,7,2,1,NULL),(277,'Тысяча птицемест','558','10^3 птицемест',NULL,'ТЫС ПТИЦЕМЕСТ',NULL,7,2,1,NULL),(278,'Тысяча кур-несушек','559','10^3 кур. несуш',NULL,'ТЫС КУР. НЕСУШ',NULL,7,2,1,NULL),(279,'Минимальная заработная плата','560','мин. заработн. плат',NULL,'МИН ЗАРАБОТН ПЛАТ',NULL,7,2,1,NULL),(280,'Тысяча тонн пара в час','561','10^3 т пар/ч',NULL,'ТЫС Т ПАР/Ч',NULL,7,2,1,NULL),(281,'Тысяча прядильных веретен','562','10^3 пряд.верет',NULL,'ТЫС ПРЯД ВЕРЕТ',NULL,7,2,1,NULL),(282,'Тысяча прядильных мест','563','10^3 пряд.мест',NULL,'ТЫС ПРЯД МЕСТ',NULL,7,2,1,NULL),(283,'Доза','639','доз',NULL,'ДОЗ',NULL,7,2,1,NULL),(284,'Тысяча доз','640','10^3 доз',NULL,'ТЫС ДОЗ',NULL,7,2,1,NULL),(285,'Единица','642','ед',NULL,'ЕД',NULL,7,2,1,NULL),(286,'Тысяча единиц','643','10^3 ед',NULL,'ТЫС ЕД',NULL,7,2,1,NULL),(287,'Миллион единиц','644','10^6 ед',NULL,'МЛН ЕД',NULL,7,2,1,NULL),(288,'Канал','661','канал',NULL,'КАНАЛ',NULL,7,2,1,NULL),(289,'Тысяча комплектов','673','10^3 компл',NULL,'ТЫС КОМПЛ',NULL,7,2,1,NULL),(290,'Место','698','мест',NULL,'МЕСТ',NULL,7,2,1,NULL),(291,'Тысяча мест','699','10^3 мест',NULL,'ТЫС МЕСТ',NULL,7,2,1,NULL),(292,'Тысяча номеров','709','10^3 ном',NULL,'ТЫС НОМ',NULL,7,2,1,NULL),(293,'Тысяча гектаров порций','724','10^3 га порц',NULL,'ТЫС ГА ПОРЦ',NULL,7,2,1,NULL),(294,'Тысяча пачек','729','10^3 пач',NULL,'ТЫС ПАЧ',NULL,7,2,1,NULL),(295,'Процент','744','%',NULL,'ПРОЦ',NULL,7,2,1,NULL),(296,'Промилле (0,1 процента)','746','промилле',NULL,'ПРОМИЛЛЕ',NULL,7,2,1,NULL),(297,'Тысяча рулонов','751','10^3 рул',NULL,'ТЫС РУЛ',NULL,7,2,1,NULL),(298,'Тысяча станов','761','10^3 стан',NULL,'ТЫС СТАН',NULL,7,2,1,NULL),(299,'Станция','762','станц',NULL,'СТАНЦ',NULL,7,2,1,NULL),(300,'Тысяча тюбиков','775','10^3 тюбик',NULL,'ТЫС ТЮБИК',NULL,7,2,1,NULL),(301,'Тысяча условных тубов','776','10^3 усл.туб',NULL,'ТЫС УСЛ ТУБ',NULL,7,2,1,NULL),(302,'Миллион упаковок','779','10^6 упак',NULL,'МЛН УПАК',NULL,7,2,1,NULL),(303,'Тысяча упаковок','782','10^3 упак',NULL,'ТЫС УПАК',NULL,7,2,1,NULL),(304,'Человек','792','чел',NULL,'ЧЕЛ',NULL,7,2,1,NULL),(305,'Тысяча человек','793','10^3 чел',NULL,'ТЫС ЧЕЛ',NULL,7,2,1,NULL),(306,'Миллион человек','794','10^6 чел',NULL,'МЛН ЧЕЛ',NULL,7,2,1,NULL),(307,'Миллион экземпляров','808','10^6 экз',NULL,'МЛН ЭКЗ',NULL,7,2,1,NULL),(308,'Ячейка','810','яч',NULL,'ЯЧ',NULL,7,2,1,NULL),(309,'Ящик','812','ящ',NULL,'ЯЩ',NULL,7,2,1,NULL),(310,'Голова','836','гол',NULL,'ГОЛ',NULL,7,2,1,NULL),(311,'Тысяча пар','837','10^3 пар',NULL,'ТЫС ПАР',NULL,7,2,1,NULL),(312,'Миллион пар','838','10^6 пар',NULL,'МЛН ПАР',NULL,7,2,1,NULL),(313,'Комплект','839','компл',NULL,'КОМПЛ',NULL,7,2,1,NULL),(314,'Секция','840','секц',NULL,'СЕКЦ',NULL,7,2,1,NULL),(315,'Бутылка','868','бут',NULL,'БУТ',NULL,7,2,1,NULL),(316,'Тысяча бутылок','869','10^3 бут',NULL,'ТЫС БУТ',NULL,7,2,1,NULL),(317,'Ампула','870','ампул',NULL,'АМПУЛ',NULL,7,2,1,NULL),(318,'Тысяча ампул','871','10^3 ампул',NULL,'ТЫС АМПУЛ',NULL,7,2,1,NULL),(319,'Флакон','872','флак',NULL,'ФЛАК',NULL,7,2,1,NULL),(320,'Тысяча флаконов','873','10^3 флак',NULL,'ТЫС ФЛАК',NULL,7,2,1,NULL),(321,'Тысяча тубов','874','10^3 туб',NULL,'ТЫС ТУБ',NULL,7,2,1,NULL),(322,'Тысяча коробок','875','10^3 кор',NULL,'ТЫС КОР',NULL,7,2,1,NULL),(323,'Условная единица','876','усл. ед',NULL,'УСЛ ЕД',NULL,7,2,1,NULL),(324,'Тысяча условных единиц','877','10^3 усл. ед',NULL,'ТЫС УСЛ ЕД',NULL,7,2,1,NULL),(325,'Миллион условных единиц','878','10^6 усл. ед',NULL,'МЛН УСЛ ЕД',NULL,7,2,1,NULL),(326,'Условная штука','879','усл. шт',NULL,'УСЛ ШТ',NULL,7,2,1,NULL),(327,'Тысяча условных штук','880','10^3 усл. шт',NULL,'ТЫС УСЛ ШТ',NULL,7,2,1,NULL),(328,'Условная банка','881','усл. банк',NULL,'УСЛ БАНК',NULL,7,2,1,NULL),(329,'Тысяча условных банок','882','10^3 усл. банк',NULL,'ТЫС УСЛ БАНК',NULL,7,2,1,NULL),(330,'Миллион условных банок','883','10^6 усл. банк',NULL,'МЛН УСЛ БАНК',NULL,7,2,1,NULL),(331,'Условный кусок','884','усл. кус',NULL,'УСЛ КУС',NULL,7,2,1,NULL),(332,'Тысяча условных кусков','885','10^3 усл. кус',NULL,'ТЫС УСЛ КУС',NULL,7,2,1,NULL),(333,'Миллион условных кусков','886','10^6 усл. кус',NULL,'МЛН УСЛ КУС',NULL,7,2,1,NULL),(334,'Условный ящик','887','усл. ящ',NULL,'УСЛ ЯЩ',NULL,7,2,1,NULL),(335,'Тысяча условных ящиков','888','10^3 усл. ящ',NULL,'ТЫС УСЛ ЯЩ',NULL,7,2,1,NULL),(336,'Условная катушка','889','усл. кат',NULL,'УСЛ КАТ',NULL,7,2,1,NULL),(337,'Тысяча условных катушек','890','10^3 усл. кат',NULL,'ТЫС УСЛ КАТ',NULL,7,2,1,NULL),(338,'Условная плитка','891','усл. плит',NULL,'УСЛ ПЛИТ',NULL,7,2,1,NULL),(339,'Тысяча условных плиток','892','10^3 усл. плит',NULL,'ТЫС УСЛ ПЛИТ',NULL,7,2,1,NULL),(340,'Условный кирпич','893','усл. кирп',NULL,'УСЛ КИРП',NULL,7,2,1,NULL),(341,'Тысяча условных кирпичей','894','10^3 усл. кирп',NULL,'ТЫС УСЛ КИРП',NULL,7,2,1,NULL),(342,'Миллион условных кирпичей','895','10^6 усл. кирп',NULL,'МЛН УСЛ КИРП',NULL,7,2,1,NULL),(343,'Семья','896','семей',NULL,'СЕМЕЙ',NULL,7,2,1,NULL),(344,'Тысяча семей','897','10^3 семей',NULL,'ТЫС СЕМЕЙ',NULL,7,2,1,NULL),(345,'Миллион семей','898','10^6 семей',NULL,'МЛН СЕМЕЙ',NULL,7,2,1,NULL),(346,'Домохозяйство','899','домхоз',NULL,'ДОМХОЗ',NULL,7,2,1,NULL),(347,'Тысяча домохозяйств','900','10^3 домхоз',NULL,'ТЫС ДОМХОЗ',NULL,7,2,1,NULL),(348,'Миллион домохозяйств','901','10^6 домхоз',NULL,'МЛН ДОМХОЗ',NULL,7,2,1,NULL),(349,'Ученическое место','902','учен. мест',NULL,'УЧЕН МЕСТ',NULL,7,2,1,NULL),(350,'Тысяча ученических мест','903','10^3 учен. мест',NULL,'ТЫС УЧЕН МЕСТ',NULL,7,2,1,NULL),(351,'Рабочее место','904','раб. мест',NULL,'РАБ МЕСТ',NULL,7,2,1,NULL),(352,'Тысяча рабочих мест','905','10^3 раб. мест',NULL,'ТЫС РАБ МЕСТ',NULL,7,2,1,NULL),(353,'Посадочное место','906','посад. мест',NULL,'ПОСАД МЕСТ',NULL,7,2,1,NULL),(354,'Тысяча посадочных мест','907','10^3 посад. мест',NULL,'ТЫС ПОСАД МЕСТ',NULL,7,2,1,NULL),(355,'Номер','908','ном',NULL,'НОМ',NULL,7,2,1,NULL),(356,'Квартира','909','кварт',NULL,'КВАРТ',NULL,7,2,1,NULL),(357,'Тысяча квартир','910','10^3 кварт',NULL,'ТЫС КВАРТ',NULL,7,2,1,NULL),(358,'Койка','911','коек',NULL,'КОЕК',NULL,7,2,1,NULL),(359,'Тысяча коек','912','10^3 коек',NULL,'ТЫС КОЕК',NULL,7,2,1,NULL),(360,'Том книжного фонда','913','том книжн. фонд',NULL,'ТОМ КНИЖН ФОНД',NULL,7,2,1,NULL),(361,'Тысяча томов книжного фонда','914','10^3 том. книжн. фонд',NULL,'ТЫС ТОМ КНИЖН ФОНД',NULL,7,2,1,NULL),(362,'Условный ремонт','915','усл. рем',NULL,'УСЛ РЕМ',NULL,7,2,1,NULL),(363,'Условный ремонт в год','916','усл. рем/год',NULL,'УСЛ РЕМ/ГОД',NULL,7,2,1,NULL),(364,'Смена','917','смен',NULL,'СМЕН',NULL,7,2,1,NULL),(365,'Лист авторский','918','л. авт',NULL,'ЛИСТ АВТ',NULL,7,2,1,NULL),(366,'Лист печатный','920','л. печ',NULL,'ЛИСТ ПЕЧ',NULL,7,2,1,NULL),(367,'Лист учетно-издательский','921','л. уч.-изд',NULL,'ЛИСТ УЧ.ИЗД',NULL,7,2,1,NULL),(368,'Знак','922','знак',NULL,'ЗНАК',NULL,7,2,1,NULL),(369,'Слово','923','слово',NULL,'СЛОВО',NULL,7,2,1,NULL),(370,'Символ','924','символ',NULL,'СИМВОЛ',NULL,7,2,1,NULL),(371,'Условная труба','925','усл. труб',NULL,'УСЛ ТРУБ',NULL,7,2,1,NULL),(372,'Тысяча пластин','930','10^3 пласт',NULL,'ТЫС ПЛАСТ',NULL,7,2,1,NULL),(373,'Миллион доз','937','10^6 доз',NULL,'МЛН ДОЗ',NULL,7,2,1,NULL),(374,'Миллион листов-оттисков','949','10^6 лист.оттиск',NULL,'МЛН ЛИСТ.ОТТИСК',NULL,7,2,1,NULL),(375,'Вагоно(машино)-день','950','ваг (маш).дн',NULL,'ВАГ (МАШ).ДН',NULL,7,2,1,NULL),(376,'Тысяча вагоно-(машино)-часов','951','10^3 ваг (маш).ч',NULL,'ТЫС ВАГ (МАШ).Ч',NULL,7,2,1,NULL),(377,'Тысяча вагоно-(машино)-километров','952','10^3 ваг (маш).км',NULL,'ТЫС ВАГ (МАШ).КМ',NULL,7,2,1,NULL),(378,'Тысяча место-километров','953','10 ^3мест.км',NULL,'ТЫС МЕСТ.КМ',NULL,7,2,1,NULL),(379,'Вагоно-сутки','954','ваг.сут',NULL,'ВАГ.СУТ',NULL,7,2,1,NULL),(380,'Тысяча поездо-часов','955','10^3 поезд.ч',NULL,'ТЫС ПОЕЗД.Ч',NULL,7,2,1,NULL),(381,'Тысяча поездо-километров','956','10^3 поезд.км',NULL,'ТЫС ПОЕЗД.КМ',NULL,7,2,1,NULL),(382,'Тысяча тонно-миль','957','10^3 т.миль',NULL,'ТЫС Т.МИЛЬ',NULL,7,2,1,NULL),(383,'Тысяча пассажиро-миль','958','10^3 пасс.миль',NULL,'ТЫС ПАСС.МИЛЬ',NULL,7,2,1,NULL),(384,'Автомобиле-день','959','автомоб.дн',NULL,'АВТОМОБ.ДН',NULL,7,2,1,NULL),(385,'Тысяча автомобиле-тонно-дней','960','10^3 автомоб.т.дн',NULL,'ТЫС АВТОМОБ.Т.ДН',NULL,7,2,1,NULL),(386,'Тысяча автомобиле-часов','961','10^3 автомоб.ч',NULL,'ТЫС АВТОМОБ.Ч',NULL,7,2,1,NULL),(387,'Тысяча автомобиле-место-дней','962','10^3 автомоб.мест. дн',NULL,'ТЫС АВТОМОБ.МЕСТ. ДН',NULL,7,2,1,NULL),(388,'Приведенный час','963','привед.ч',NULL,'ПРИВЕД.Ч',NULL,7,2,1,NULL),(389,'Самолето-километр','964','самолет.км',NULL,'САМОЛЕТ.КМ',NULL,7,2,1,NULL),(390,'Тысяча километров','965','10^3 км',NULL,'ТЫС КМ',NULL,7,2,1,NULL),(391,'Тысяча тоннаже-рейсов','966','10^3 тоннаж. рейс',NULL,'ТЫС ТОННАЖ. РЕЙС',NULL,7,2,1,NULL),(392,'Миллион тонно-миль','967','10^6 т. миль',NULL,'МЛН Т. МИЛЬ',NULL,7,2,1,NULL),(393,'Миллион пассажиро-миль','968','10^6 пасс. миль',NULL,'МЛН ПАСС. МИЛЬ',NULL,7,2,1,NULL),(394,'Миллион тоннаже-миль','969','10^6 тоннаж. миль',NULL,'МЛН ТОННАЖ. МИЛЬ',NULL,7,2,1,NULL),(395,'Миллион пассажиро-место-миль','970','10^6 пасс. мест. миль',NULL,'МЛН ПАСС. МЕСТ. МИЛЬ',NULL,7,2,1,NULL),(396,'Кормо-день','971','корм. дн',NULL,'КОРМ. ДН',NULL,7,2,1,NULL),(397,'Центнер кормовых единиц','972','ц корм ед',NULL,'Ц КОРМ ЕД',NULL,7,2,1,NULL),(398,'Тысяча автомобиле-километров','973','10^3 автомоб. км',NULL,'ТЫС АВТОМОБ. КМ',NULL,7,2,1,NULL),(399,'Тысяча тоннаже-сут','974','10^3 тоннаж. сут',NULL,'ТЫС ТОННАЖ. СУТ',NULL,7,2,1,NULL),(400,'Суго-сутки','975','суго. сут.',NULL,'СУГО. СУТ',NULL,7,2,1,NULL),(401,'Штук в 20-футовом эквиваленте (ДФЭ)','976','штук в 20-футовом эквиваленте',NULL,'ШТ В 20 ФУТ ЭКВИВ',NULL,7,2,1,NULL),(402,'Канало-километр','977','канал. км',NULL,'КАНАЛ. КМ',NULL,7,2,1,NULL),(403,'Канало-концы','978','канал. конц',NULL,'КАНАЛ. КОНЦ',NULL,7,2,1,NULL),(404,'Тысяча экземпляров','979','10^3 экз',NULL,'ТЫС ЭКЗ',NULL,7,2,1,NULL),(405,'Тысяча долларов','980','10^3 доллар',NULL,'ТЫС ДОЛЛАР',NULL,7,2,1,NULL),(406,'Тысяча тонн кормовых единиц','981','10^3 корм ед',NULL,'ТЫС Т КОРМ ЕД',NULL,7,2,1,NULL),(407,'Миллион тонн кормовых единиц','982','10^6 корм ед',NULL,'МЛН Т КОРМ ЕД',NULL,7,2,1,NULL),(408,'Судо-сутки','983','суд.сут',NULL,'СУД.СУТ',NULL,7,2,1,NULL),(409,'Гектометр','017',NULL,'hm',NULL,'HMT',1,3,1,NULL),(410,'Миля (уставная) (1609,344 м)','045',NULL,'mile',NULL,'SMI',1,3,1,NULL),(411,'Акр (4840 квадратных ярдов)','077',NULL,'acre',NULL,'ACR',2,3,1,NULL),(412,'Квадратная миля','079',NULL,'mile2',NULL,'MIK',2,3,1,NULL),(413,'Жидкостная унция СК (28,413 см3)','135',NULL,'fl oz (UK)',NULL,'OZI',3,3,1,NULL),(414,'Джилл СК (0,142065 дм3)','136',NULL,'gill (UK)',NULL,'GII',3,3,1,NULL),(415,'Пинта СК (0,568262 дм3)','137',NULL,'pt (UK)',NULL,'PTI',3,3,1,NULL),(416,'Кварта СК (1,136523 дм3)','138',NULL,'qt (UK)',NULL,'QTI',3,3,1,NULL),(417,'Галлон СК (4,546092 дм3)','139',NULL,'gal (UK)',NULL,'GLI',3,3,1,NULL),(418,'Бушель СК (36,36874 дм3)','140',NULL,'bu (UK)',NULL,'BUI',3,3,1,NULL),(419,'Жидкостная унция США (29,5735 см3)','141',NULL,'fl oz (US)',NULL,'OZA',3,3,1,NULL),(420,'Джилл США (11,8294 см3)','142',NULL,'gill (US)',NULL,'GIA',3,3,1,NULL),(421,'Жидкостная пинта США (0,473176 дм3)','143',NULL,'liq pt (US)',NULL,'PTL',3,3,1,NULL),(422,'Жидкостная кварта США (0,946353 дм3)','144',NULL,'liq qt (US)',NULL,'QTL',3,3,1,NULL),(423,'Жидкостный галлон США (3,78541 дм3)','145',NULL,'gal (US)',NULL,'GLL',3,3,1,NULL),(424,'Баррель (нефтяной) США (158,987 дм3)','146',NULL,'barrel (US)',NULL,'BLL',3,3,1,NULL),(425,'Сухая пинта США (0,55061 дм3)','147',NULL,'dry pt (US)',NULL,'PTD',3,3,1,NULL),(426,'Сухая кварта США (1,101221 дм3)','148',NULL,'dry qt (US)',NULL,'QTD',3,3,1,NULL),(427,'Сухой галлон США (4,404884 дм3)','149',NULL,'dry gal (US)',NULL,'GLD',3,3,1,NULL),(428,'Бушель США (35,2391 дм3)','150',NULL,'bu (US)',NULL,'BUA',3,3,1,NULL),(429,'Сухой баррель США (115,627 дм3)','151',NULL,'bbl (US)',NULL,'BLD',3,3,1,NULL),(430,'Стандарт','152',NULL,'-',NULL,'WSD',3,3,1,NULL),(431,'Корд (3,63 м3)','153',NULL,'-',NULL,'WCD',3,3,1,NULL),(432,'Тысячи бордфутов (2,36 м3)','154',NULL,'-',NULL,'MBF',3,3,1,NULL),(433,'Нетто-регистровая тонна','182',NULL,'-',NULL,'NTT',4,3,1,NULL),(434,'Обмерная (фрахтовая) тонна','183',NULL,'-',NULL,'SHT',4,3,1,NULL),(435,'Водоизмещение','184',NULL,'-',NULL,'DPT',4,3,1,NULL),(436,'Фунт СК, США (0,45359237 кг)','186',NULL,'lb',NULL,'LBR',4,3,1,NULL),(437,'Унция СК, США (28,349523 г)','187',NULL,'oz',NULL,'ONZ',4,3,1,NULL),(438,'Драхма СК (1,771745 г)','188',NULL,'dr',NULL,'DRI',4,3,1,NULL),(439,'Гран СК, США (64,798910 мг)','189',NULL,'gn',NULL,'GRN',4,3,1,NULL),(440,'Стоун СК (6,350293 кг)','190',NULL,'st',NULL,'STI',4,3,1,NULL),(441,'Квартер СК (12,700586 кг)','191',NULL,'qtr',NULL,'QTR',4,3,1,NULL),(442,'Центал СК (45,359237 кг)','192',NULL,'-',NULL,'CNT',4,3,1,NULL),(443,'Центнер США (45,3592 кг)','193',NULL,'cwt',NULL,'CWA',4,3,1,NULL),(444,'Длинный центнер СК (50,802345 кг)','194',NULL,'cwt (UK)',NULL,'CWI',4,3,1,NULL),(445,'Короткая тонна СК, США (0,90718474 т) [2*]','195',NULL,'sht',NULL,'STN',4,3,1,NULL),(446,'Длинная тонна СК, США (1,0160469 т) [2*]','196',NULL,'lt',NULL,'LTN',4,3,1,NULL),(447,'Скрупул СК, США (1,295982 г)','197',NULL,'scr',NULL,'SCR',4,3,1,NULL),(448,'Пеннивейт СК, США (1,555174 г)','198',NULL,'dwt',NULL,'DWT',4,3,1,NULL),(449,'Драхма СК (3,887935 г)','199',NULL,'drm',NULL,'DRM',4,3,1,NULL),(450,'Драхма США (3,887935 г)','200',NULL,'-',NULL,'DRA',4,3,1,NULL),(451,'Унция СК, США (31,10348 г); тройская унция','201',NULL,'apoz',NULL,'APZ',4,3,1,NULL),(452,'Тройский фунт США (373,242 г)','202',NULL,'-',NULL,'LBT',4,3,1,NULL),(453,'Эффективная мощность (245,7 ватт)','213',NULL,'B.h.p.',NULL,'BHP',5,3,1,NULL),(454,'Британская тепловая единица (1,055 кДж)','275',NULL,'Btu',NULL,'BTU',5,3,1,NULL),(455,'Гросс (144 шт.)','638',NULL,'gr; 144',NULL,'GRO',7,3,1,NULL),(456,'Большой гросс (12 гроссов)','731',NULL,'1728',NULL,'GGR',7,3,1,NULL),(457,'Короткий стандарт (7200 единиц)','738',NULL,'-',NULL,'SST',7,3,1,NULL),(458,'Галлон спирта установленной крепости','835',NULL,'-',NULL,'PGL',7,3,1,NULL),(459,'Международная единица','851',NULL,'-',NULL,'NIU',7,3,1,NULL),(460,'Сто международных единиц','853',NULL,'-',NULL,'HIU',7,3,1,NULL);
/*!40000 ALTER TABLE `class_unit` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `class_unit_group`
--

DROP TABLE IF EXISTS `class_unit_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `class_unit_group` (
  `id` tinyint(4) NOT NULL AUTO_INCREMENT COMMENT 'pk',
  `name` varchar(255) NOT NULL COMMENT 'Наименование группы',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8 COMMENT='Группы единиц измерения';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `class_unit_group`
--

LOCK TABLES `class_unit_group` WRITE;
/*!40000 ALTER TABLE `class_unit_group` DISABLE KEYS */;
INSERT INTO `class_unit_group` VALUES (6,'Единицы времени'),(1,'Единицы длины'),(4,'Единицы массы'),(3,'Единицы объема'),(2,'Единицы площади'),(5,'Технические единицы'),(7,'Экономические единицы');
/*!40000 ALTER TABLE `class_unit_group` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `class_unit_type`
--

DROP TABLE IF EXISTS `class_unit_type`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `class_unit_type` (
  `id` tinyint(4) NOT NULL AUTO_INCREMENT COMMENT 'pk',
  `name` varchar(255) NOT NULL COMMENT 'Наименование раздела/приложения',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='Разделы/приложения, в которые включены единицы измерения';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `class_unit_type`
--

LOCK TABLES `class_unit_type` WRITE;
/*!40000 ALTER TABLE `class_unit_type` DISABLE KEYS */;
INSERT INTO `class_unit_type` VALUES (1,'Международные единицы измерения, включенные в ЕСКК'),(2,'Национальные единицы измерения, включенные в ЕСКК'),(3,'Международные единицы измерения, не включенные в ЕСКК');
/*!40000 ALTER TABLE `class_unit_type` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `counter`
--

DROP TABLE IF EXISTS `counter`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `counter` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` bigint(20) NOT NULL DEFAULT '0',
  `ip` varchar(30) NOT NULL DEFAULT '',
  `agent` varchar(150) NOT NULL,
  `refer` varchar(200) NOT NULL,
  `file` varchar(20) NOT NULL DEFAULT '',
  `query` varchar(50) NOT NULL DEFAULT '',
  UNIQUE KEY `id` (`id`),
  KEY `time` (`date`),
  KEY `ip` (`ip`),
  KEY `agent` (`agent`),
  KEY `refer` (`refer`),
  KEY `file` (`file`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `counter`
--

LOCK TABLES `counter` WRITE;
/*!40000 ALTER TABLE `counter` DISABLE KEYS */;
/*!40000 ALTER TABLE `counter` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `currency`
--

DROP TABLE IF EXISTS `currency`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `currency` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(10) NOT NULL,
  `coeff` decimal(8,4) NOT NULL,
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=MyISAM AUTO_INCREMENT=52 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `currency`
--

LOCK TABLES `currency` WRITE;
/*!40000 ALTER TABLE `currency` DISABLE KEYS */;
INSERT INTO `currency` VALUES (0,'RUR',1.0000),(1,'USD',46.4244),(2,'EUR',57.9052),(3,'AUD',39.6139),(4,'BYR',42.5912),(5,'CAD',41.2075),(6,'CHF',48.1881),(7,'CNY',75.6258),(8,'DKK',77.8907),(9,'XDR',67.8952),(10,'GBP',72.9884),(11,'ISK',23.8315),(12,'JPY',39.4262),(13,'KZT',25.6602),(14,'NOK',68.1479),(15,'SEK',62.4866),(16,'SGD',35.6809),(17,'TRY',20.8997),(18,'UAH',30.7446),(34,'RUB',1.0000),(35,'AZN',59.2904),(36,'AMD',10.6919),(37,'BGN',29.6244),(38,'BRL',18.3467),(39,'HUF',18.9333),(40,'INR',75.0415),(41,'KGS',80.6314),(42,'LTL',16.7846),(43,'MDL',30.9496),(44,'PLN',13.8709),(45,'RON',13.0736),(46,'TJS',88.0334),(47,'TMT',16.2875),(48,'UZS',19.3347),(49,'CZK',21.0103),(50,'ZAR',42.3379),(51,'KRW',41.9390);
/*!40000 ALTER TABLE `currency` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `db_version`
--

DROP TABLE IF EXISTS `db_version`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `db_version` (
  `version` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='Текущая версия базы данных';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `db_version`
--

LOCK TABLES `db_version` WRITE;
/*!40000 ALTER TABLE `db_version` DISABLE KEYS */;
INSERT INTO `db_version` VALUES (750);
/*!40000 ALTER TABLE `db_version` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `delivery_regions`
--

DROP TABLE IF EXISTS `delivery_regions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `delivery_regions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `delivery_type` int(11) NOT NULL,
  `name` varchar(128) NOT NULL,
  `price` int(11) NOT NULL,
  `description` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `delivery_regions`
--

LOCK TABLES `delivery_regions` WRITE;
/*!40000 ALTER TABLE `delivery_regions` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery_regions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `delivery_types`
--

DROP TABLE IF EXISTS `delivery_types`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `delivery_types` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(128) NOT NULL,
  `min_price` int(11) NOT NULL,
  `service_id` int(11) NOT NULL,
  `description` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `delivery_types`
--

LOCK TABLES `delivery_types` WRITE;
/*!40000 ALTER TABLE `delivery_types` DISABLE KEYS */;
/*!40000 ALTER TABLE `delivery_types` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_accounts`
--

DROP TABLE IF EXISTS `doc_accounts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_accounts` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `account` varchar(8) NOT NULL,
  `name` varchar(64) NOT NULL,
  `usedby` varchar(64) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `account` (`account`),
  KEY `name` (`name`),
  KEY `usedby` (`usedby`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='Бухгалтерские счета';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_accounts`
--

LOCK TABLES `doc_accounts` WRITE;
/*!40000 ALTER TABLE `doc_accounts` DISABLE KEYS */;
INSERT INTO `doc_accounts` VALUES (1,'50.1','Касса организации','kassa'),(2,'51','Расчетные счета','bank');
/*!40000 ALTER TABLE `doc_accounts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_agent`
--

DROP TABLE IF EXISTS `doc_agent`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_agent` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `fullname` varchar(200) NOT NULL,
  `tel` varchar(64) NOT NULL,
  `sms_phone` varchar(16) NOT NULL,
  `fax_phone` varchar(16) NOT NULL,
  `alt_phone` varchar(16) NOT NULL,
  `adres` varchar(300) NOT NULL,
  `real_address` varchar(256) NOT NULL,
  `inn` varchar(24) NOT NULL,
  `kpp` varchar(16) NOT NULL,
  `dir_fio` varchar(128) NOT NULL,
  `dir_fio_r` varchar(128) NOT NULL,
  `pfio` text NOT NULL,
  `pdol` text NOT NULL,
  `okved` varchar(8) NOT NULL,
  `okpo` varchar(10) NOT NULL,
  `ogrn` varchar(16) NOT NULL,
  `rs` varchar(22) NOT NULL,
  `bank` varchar(128) NOT NULL,
  `ks` varchar(50) NOT NULL,
  `bik` varchar(12) NOT NULL,
  `group` int(11) NOT NULL,
  `email` varchar(64) NOT NULL,
  `type` tinyint(4) NOT NULL DEFAULT '1',
  `pasp_num` varchar(12) NOT NULL,
  `pasp_date` date NOT NULL,
  `pasp_kem` varchar(60) NOT NULL,
  `comment` text NOT NULL,
  `no_mail` tinyint(4) NOT NULL,
  `responsible` int(11) DEFAULT NULL,
  `data_sverki` date NOT NULL,
  `dishonest` tinyint(4) NOT NULL,
  `p_agent` int(11) DEFAULT NULL COMMENT 'Подчинение другому агенту',
  `bonus` decimal(10,2) NOT NULL,
  `avg_sum` int(11) NOT NULL COMMENT 'Средняя сумма оборотов агента за период',
  `price_id` int(11) DEFAULT NULL,
  `no_bulk_prices` tinyint(4) NOT NULL,
  `no_retail_prices` tinyint(4) NOT NULL,
  `no_bonuses` tinyint(4) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `name` (`name`),
  KEY `fullname` (`fullname`),
  KEY `tel` (`tel`),
  KEY `inn` (`inn`),
  KEY `type` (`type`),
  KEY `pasp_num` (`pasp_num`,`pasp_date`,`pasp_kem`),
  KEY `responsible` (`responsible`),
  KEY `p_agent` (`p_agent`),
  KEY `kpp` (`kpp`),
  KEY `ogrn` (`ogrn`),
  CONSTRAINT `doc_agent_ibfk_1` FOREIGN KEY (`p_agent`) REFERENCES `doc_agent` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='pcomment - printable comment';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_agent`
--

LOCK TABLES `doc_agent` WRITE;
/*!40000 ALTER TABLE `doc_agent` DISABLE KEYS */;
INSERT INTO `doc_agent` VALUES (1,'Частное лицо','','','','','','','','','','','','','','','','','','','','',0,'',1,'','0000-00-00','','',0,NULL,'0000-00-00',0,NULL,0.00,0,NULL,0,0,0),(2,'ООО РиК','','','','','','','','','','','','','','','','','','','','',0,'',0,'','0000-00-00','','',0,NULL,'0000-00-00',0,NULL,0.00,0,NULL,0,0,0);
/*!40000 ALTER TABLE `doc_agent` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_agent_dov`
--

DROP TABLE IF EXISTS `doc_agent_dov`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_agent_dov` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ag_id` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `name2` varchar(50) NOT NULL,
  `surname` varchar(50) NOT NULL,
  `range` varchar(50) NOT NULL,
  `pasp_ser` varchar(5) NOT NULL,
  `pasp_num` varchar(10) NOT NULL,
  `pasp_kem` varchar(100) NOT NULL,
  `pasp_data` varchar(15) NOT NULL,
  `mark_del` bigint(20) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `ag_id` (`ag_id`),
  KEY `name` (`name`),
  KEY `name2` (`name2`),
  KEY `surname` (`surname`),
  KEY `range` (`range`),
  KEY `pasp_ser` (`pasp_ser`),
  KEY `pasp_num` (`pasp_num`),
  KEY `pasp_kem` (`pasp_kem`),
  KEY `pasp_data` (`pasp_data`),
  KEY `mark_del` (`mark_del`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_agent_dov`
--

LOCK TABLES `doc_agent_dov` WRITE;
/*!40000 ALTER TABLE `doc_agent_dov` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_agent_dov` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_agent_group`
--

DROP TABLE IF EXISTS `doc_agent_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_agent_group` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `pid` int(11) NOT NULL,
  `desc` varchar(100) NOT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 PACK_KEYS=0;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_agent_group`
--

LOCK TABLES `doc_agent_group` WRITE;
/*!40000 ALTER TABLE `doc_agent_group` DISABLE KEYS */;
INSERT INTO `doc_agent_group` VALUES (1,'Покупатели',0,''),(2,'Поставщики',0,'');
/*!40000 ALTER TABLE `doc_agent_group` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base`
--

DROP TABLE IF EXISTS `doc_base`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `group` int(11) NOT NULL DEFAULT '0',
  `name` varchar(100) NOT NULL,
  `vc` varchar(32) NOT NULL,
  `country` int(11) DEFAULT NULL,
  `desc` text NOT NULL,
  `cost` double(10,2) NOT NULL DEFAULT '0.00',
  `stock` tinyint(1) NOT NULL,
  `proizv` varchar(20) NOT NULL,
  `likvid` decimal(10,2) NOT NULL DEFAULT '0.00',
  `cost_date` datetime NOT NULL,
  `pos_type` tinyint(4) NOT NULL,
  `hidden` tinyint(4) NOT NULL,
  `no_export_yml` tinyint(4) NOT NULL,
  `unit` int(11) NOT NULL,
  `warranty` int(11) NOT NULL,
  `warranty_type` tinyint(4) NOT NULL,
  `meta_description` varchar(256) NOT NULL,
  `meta_keywords` varchar(128) NOT NULL,
  `title_tag` varchar(128) NOT NULL,
  `create_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `buy_time` datetime NOT NULL DEFAULT '1970-01-01 00:00:00',
  `transit_cnt` int(11) NOT NULL DEFAULT '0',
  `mult` int(11) NOT NULL COMMENT 'Кратность',
  `bulkcnt` int(11) NOT NULL COMMENT 'Количество оптом',
  `analog_group` varchar(32) NOT NULL,
  `mass` double NOT NULL,
  `nds` tinyint(4) DEFAULT NULL COMMENT 'Ставка НДС',
  UNIQUE KEY `id` (`id`),
  KEY `group` (`group`),
  KEY `name` (`name`),
  KEY `cost_date` (`cost_date`),
  KEY `hidden` (`hidden`),
  KEY `unit` (`unit`),
  KEY `stock` (`stock`),
  KEY `country` (`country`),
  KEY `create_time` (`create_time`),
  KEY `buy_time` (`buy_time`),
  KEY `transit_cnt` (`transit_cnt`),
  KEY `analog_group` (`analog_group`),
  KEY `mass` (`mass`),
  CONSTRAINT `doc_base_ibfk_1` FOREIGN KEY (`group`) REFERENCES `doc_group` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `doc_base_ibfk_2` FOREIGN KEY (`country`) REFERENCES `class_country` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `doc_base_ibfk_3` FOREIGN KEY (`unit`) REFERENCES `class_unit` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base`
--

LOCK TABLES `doc_base` WRITE;
/*!40000 ALTER TABLE `doc_base` DISABLE KEYS */;
INSERT INTO `doc_base` VALUES (2,1,'Товар','',NULL,'',0.00,0,'',0.00,'0000-00-00 00:00:00',0,0,0,1,0,0,'','','','2015-03-23 16:22:36','1970-01-01 00:00:00',0,0,0,'',0,NULL),(3,2,'Услуга','',NULL,'',0.00,0,'',0.00,'0000-00-00 00:00:00',0,0,0,1,0,0,'','','','2015-03-23 16:22:52','1970-01-01 00:00:00',0,0,0,'',0,NULL);
/*!40000 ALTER TABLE `doc_base` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_attachments`
--

DROP TABLE IF EXISTS `doc_base_attachments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_attachments` (
  `pos_id` int(11) NOT NULL,
  `attachment_id` int(11) NOT NULL,
  UNIQUE KEY `uni` (`pos_id`,`attachment_id`),
  KEY `attachment_id` (`attachment_id`),
  CONSTRAINT `doc_base_attachments_ibfk_4` FOREIGN KEY (`attachment_id`) REFERENCES `attachments` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `doc_base_attachments_ibfk_3` FOREIGN KEY (`pos_id`) REFERENCES `doc_base` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='ÐŸÑ€Ð¸ÐºÑ€ÐµÐ¿Ð»Ñ‘Ð½Ð½Ñ‹Ðµ Ñ„Ð°Ð¹Ð»Ñ‹';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_attachments`
--

LOCK TABLES `doc_base_attachments` WRITE;
/*!40000 ALTER TABLE `doc_base_attachments` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_attachments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_cnt`
--

DROP TABLE IF EXISTS `doc_base_cnt`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_cnt` (
  `id` int(11) NOT NULL,
  `sklad` tinyint(4) NOT NULL,
  `cnt` double NOT NULL,
  `mesto` varchar(6) NOT NULL,
  `mincnt` varchar(8) NOT NULL,
  PRIMARY KEY (`id`,`sklad`),
  KEY `cnt` (`cnt`),
  KEY `mesto` (`mesto`),
  KEY `mincnt` (`mincnt`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_cnt`
--

LOCK TABLES `doc_base_cnt` WRITE;
/*!40000 ALTER TABLE `doc_base_cnt` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_cnt` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_cost`
--

DROP TABLE IF EXISTS `doc_base_cost`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_cost` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pos_id` int(11) NOT NULL,
  `cost_id` int(11) NOT NULL,
  `type` varchar(5) NOT NULL,
  `value` decimal(8,2) NOT NULL,
  `accuracy` tinyint(4) NOT NULL,
  `direction` tinyint(4) NOT NULL,
  `rrp_firm_id` int(11) DEFAULT NULL,
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `uniq` (`pos_id`,`cost_id`),
  KEY `group_id` (`pos_id`),
  KEY `cost_id` (`cost_id`),
  KEY `value` (`value`),
  KEY `type` (`type`),
  CONSTRAINT `doc_base_cost_ibfk_1` FOREIGN KEY (`pos_id`) REFERENCES `doc_base` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `doc_base_cost_ibfk_2` FOREIGN KEY (`cost_id`) REFERENCES `doc_cost` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_cost`
--

LOCK TABLES `doc_base_cost` WRITE;
/*!40000 ALTER TABLE `doc_base_cost` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_cost` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_dop`
--

DROP TABLE IF EXISTS `doc_base_dop`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_dop` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` int(11) DEFAULT NULL,
  `d_int` double NOT NULL DEFAULT '0',
  `d_ext` double NOT NULL DEFAULT '0',
  `size` double NOT NULL DEFAULT '0',
  `mass` double NOT NULL DEFAULT '0',
  `analog` varchar(30) NOT NULL,
  `koncost` double NOT NULL DEFAULT '0',
  `ntd` varchar(32) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `type` (`type`),
  KEY `d_int` (`d_int`),
  KEY `d_ext` (`d_ext`),
  KEY `size` (`size`),
  KEY `mass` (`mass`),
  KEY `analog` (`analog`),
  KEY `koncost` (`koncost`),
  KEY `ntd` (`ntd`),
  CONSTRAINT `doc_base_dop_ibfk_2` FOREIGN KEY (`type`) REFERENCES `doc_base_dop_type` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_dop`
--

LOCK TABLES `doc_base_dop` WRITE;
/*!40000 ALTER TABLE `doc_base_dop` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_dop` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_dop_type`
--

DROP TABLE IF EXISTS `doc_base_dop_type`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_dop_type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(70) NOT NULL,
  `desc` text NOT NULL,
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_dop_type`
--

LOCK TABLES `doc_base_dop_type` WRITE;
/*!40000 ALTER TABLE `doc_base_dop_type` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_dop_type` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_gparams`
--

DROP TABLE IF EXISTS `doc_base_gparams`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_gparams` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(64) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_gparams`
--

LOCK TABLES `doc_base_gparams` WRITE;
/*!40000 ALTER TABLE `doc_base_gparams` DISABLE KEYS */;
INSERT INTO `doc_base_gparams` VALUES (1,'Общие');
/*!40000 ALTER TABLE `doc_base_gparams` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_img`
--

DROP TABLE IF EXISTS `doc_base_img`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_img` (
  `pos_id` int(11) NOT NULL,
  `img_id` int(11) NOT NULL,
  `default` tinyint(4) NOT NULL,
  UNIQUE KEY `pos_id` (`pos_id`,`img_id`),
  KEY `default` (`default`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_img`
--

LOCK TABLES `doc_base_img` WRITE;
/*!40000 ALTER TABLE `doc_base_img` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_img` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_kompl`
--

DROP TABLE IF EXISTS `doc_base_kompl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_kompl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pos_id` int(11) NOT NULL COMMENT 'id наименования',
  `kompl_id` int(11) NOT NULL COMMENT 'id комплектующего',
  `cnt` double NOT NULL COMMENT 'количество',
  UNIQUE KEY `id` (`id`),
  KEY `kompl_id` (`kompl_id`),
  KEY `cnt` (`cnt`),
  KEY `pos_id` (`pos_id`),
  CONSTRAINT `doc_base_kompl_ibfk_1` FOREIGN KEY (`pos_id`) REFERENCES `doc_base` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `doc_base_kompl_ibfk_2` FOREIGN KEY (`kompl_id`) REFERENCES `doc_base` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Комплектующие - из чего состоит эта позиция';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_kompl`
--

LOCK TABLES `doc_base_kompl` WRITE;
/*!40000 ALTER TABLE `doc_base_kompl` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_kompl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_links`
--

DROP TABLE IF EXISTS `doc_base_links`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_links` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pos1_id` int(11) NOT NULL,
  `pos2_id` int(11) NOT NULL,
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `uni` (`pos1_id`,`pos2_id`),
  KEY `pos1_id` (`pos1_id`),
  KEY `pos2_id` (`pos2_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Связи товаров';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_links`
--

LOCK TABLES `doc_base_links` WRITE;
/*!40000 ALTER TABLE `doc_base_links` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_links` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_params`
--

DROP TABLE IF EXISTS `doc_base_params`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_params` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `param` varchar(64) NOT NULL,
  `type` varchar(8) NOT NULL,
  `pgroup_id` int(11) DEFAULT NULL,
  `system` tinyint(4) NOT NULL COMMENT 'Ð¡Ð»ÑƒÐ¶ÐµÐ±Ð½Ñ‹Ð¹ Ð¿Ð°Ñ€Ð°Ð¼ÐµÑ‚Ñ€. ÐÐ¸Ð³Ð´Ðµ Ð½Ðµ Ð¾Ñ‚Ð¾Ð±Ñ€Ð°Ð¶Ð°ÐµÑ‚ÑÑ.',
  `ym_assign` varchar(128) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `param` (`param`),
  KEY `ym_assign` (`ym_assign`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_params`
--

LOCK TABLES `doc_base_params` WRITE;
/*!40000 ALTER TABLE `doc_base_params` DISABLE KEYS */;
INSERT INTO `doc_base_params` VALUES (1,'Высота (Bi)','float',1,0,''),(2,'Ширина','int',1,0,''),(3,'Кривизна','int',1,0,''),(4,'Материал','text',1,0,''),(5,'Допустимая температура','int',1,0,''),(6,'ZP','double',1,1,''),(7,'Высота оси','float',2,0,''),(8,'Расстояние между крепежными отверстиями','float',2,0,''),(9,'Статическая','float',3,0,''),(10,'Динамическая','float',3,0,'');
/*!40000 ALTER TABLE `doc_base_params` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_pcollections_list`
--

DROP TABLE IF EXISTS `doc_base_pcollections_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_pcollections_list` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(128) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Наборы свойств складской номенклатуры';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_pcollections_list`
--

LOCK TABLES `doc_base_pcollections_list` WRITE;
/*!40000 ALTER TABLE `doc_base_pcollections_list` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_pcollections_list` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_pcollections_set`
--

DROP TABLE IF EXISTS `doc_base_pcollections_set`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_pcollections_set` (
  `collection_id` int(11) NOT NULL,
  `param_id` int(11) NOT NULL,
  UNIQUE KEY `uniq` (`collection_id`,`param_id`),
  KEY `collection_id` (`collection_id`),
  KEY `param_id` (`param_id`),
  CONSTRAINT `doc_base_pcollections_set_ibfk_1` FOREIGN KEY (`collection_id`) REFERENCES `doc_base_pcollections_list` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `doc_base_pcollections_set_ibfk_2` FOREIGN KEY (`param_id`) REFERENCES `doc_base_params` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COMMENT='Список параметров в наборе';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_pcollections_set`
--

LOCK TABLES `doc_base_pcollections_set` WRITE;
/*!40000 ALTER TABLE `doc_base_pcollections_set` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_pcollections_set` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_base_values`
--

DROP TABLE IF EXISTS `doc_base_values`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_base_values` (
  `id` int(11) NOT NULL,
  `param_id` int(11) NOT NULL,
  `value` varchar(32) NOT NULL,
  `intval` int(11) NOT NULL,
  `doubleval` double NOT NULL,
  `strval` varchar(512) NOT NULL,
  UNIQUE KEY `unique` (`id`,`param_id`),
  KEY `id` (`id`),
  KEY `param` (`param_id`),
  KEY `value` (`value`),
  KEY `intval` (`intval`),
  KEY `doubleval` (`doubleval`),
  KEY `strval` (`strval`(255)),
  CONSTRAINT `doc_base_values_ibfk_1` FOREIGN KEY (`id`) REFERENCES `doc_base` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `doc_base_values_ibfk_2` FOREIGN KEY (`param_id`) REFERENCES `doc_base_params` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_base_values`
--

LOCK TABLES `doc_base_values` WRITE;
/*!40000 ALTER TABLE `doc_base_values` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_base_values` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_cost`
--

DROP TABLE IF EXISTS `doc_cost`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_cost` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(25) NOT NULL,
  `type` varchar(5) NOT NULL,
  `value` decimal(8,2) NOT NULL COMMENT 'Значение цены',
  `vid` tinyint(4) NOT NULL COMMENT 'Вид цены определяет места её использования',
  `accuracy` tinyint(4) NOT NULL,
  `direction` tinyint(4) NOT NULL,
  `context` varchar(8) NOT NULL COMMENT 'Контекст цены определяет места её использования',
  `priority` tinyint(4) NOT NULL COMMENT 'Приоритет задаёт очерёдность цен с одним контекстом',
  `bulk_threshold` int(11) NOT NULL COMMENT 'Порог включения цены по сумме заказа',
  `acc_threshold` int(11) NOT NULL COMMENT 'Порог включения цены по накопленной сумме',
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_cost`
--

LOCK TABLES `doc_cost` WRITE;
/*!40000 ALTER TABLE `doc_cost` DISABLE KEYS */;
INSERT INTO `doc_cost` VALUES (1,'Розничная','pp',50.00,1,2,0,'rd',0,0,0),(2,'Мелкий опт','pp',45.00,0,2,0,'sb',3,1500,1500),(3,'Оптовая','pp',43.00,-2,2,0,'b',2,7000,7000),(4,'Корпоративная','pp',40.00,-1,2,0,'b',1,50000,50000);
/*!40000 ALTER TABLE `doc_cost` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_ctypes`
--

DROP TABLE IF EXISTS `doc_ctypes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_ctypes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `account` varchar(8) NOT NULL,
  `name` varchar(64) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `account` (`account`),
  KEY `name` (`name`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8 COMMENT='Статьи доходов';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_ctypes`
--

LOCK TABLES `doc_ctypes` WRITE;
/*!40000 ALTER TABLE `doc_ctypes` DISABLE KEYS */;
INSERT INTO `doc_ctypes` VALUES (1,'62','Расчеты с покупателями и заказчиками'),(2,'71','Расчеты с подотчетными лицами'),(3,'90','Продажи'),(4,'91','Прочие доходы и расходы'),(5,'98','Доходы будущих периодов');
/*!40000 ALTER TABLE `doc_ctypes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_dopdata`
--

DROP TABLE IF EXISTS `doc_dopdata`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_dopdata` (
  `doc` int(11) NOT NULL,
  `param` varchar(20) NOT NULL,
  `value` varchar(150) NOT NULL,
  UNIQUE KEY `doc` (`doc`,`param`),
  KEY `value` (`value`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_dopdata`
--

LOCK TABLES `doc_dopdata` WRITE;
/*!40000 ALTER TABLE `doc_dopdata` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_dopdata` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_dtypes`
--

DROP TABLE IF EXISTS `doc_dtypes`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_dtypes` (
  `id` int(11) NOT NULL,
  `account` varchar(8) NOT NULL COMMENT 'Бух. счет',
  `name` varchar(64) NOT NULL,
  `adm` tinyint(4) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `name` (`name`),
  KEY `adm` (`adm`),
  KEY `account` (`account`)
) ENGINE=MyISAM AUTO_INCREMENT=16 DEFAULT CHARSET=utf8 PACK_KEYS=0 COMMENT='Статьи расходов';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_dtypes`
--

LOCK TABLES `doc_dtypes` WRITE;
/*!40000 ALTER TABLE `doc_dtypes` DISABLE KEYS */;
INSERT INTO `doc_dtypes` VALUES (0,'','Прочие расходы',1),(1,'60','Аренда офиса, склада',1),(2,'70','Зарплата, премии, надбавки',1),(3,'44','Канцелярские товары, расходные материалы',1),(4,'44','Представительские расходы',1),(5,'','Другие (банковские) платежи',1),(6,'60','Закупка товара на склад',0),(7,'60','Закупка товара на продажу',0),(8,'60','Транспортные расходы',1),(9,'60','Расходы на связь',1),(10,'62','Оплата товара на реализации',0),(11,'68.02','Налоги и сборы НДС',1),(12,'71','Средства под отчёт',1),(13,'44','Расходы на рекламу',1),(14,'62','Возврат товара',0),(15,'60','Закупка и амортизация оборудования офиса и склада, логистика',1);
/*!40000 ALTER TABLE `doc_dtypes` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_group`
--

DROP TABLE IF EXISTS `doc_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_group` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `desc` text NOT NULL,
  `pid` int(11) NOT NULL,
  `hidelevel` tinyint(4) NOT NULL,
  `printname` varchar(50) NOT NULL,
  `no_export_yml` tinyint(4) NOT NULL,
  `meta_description` varchar(256) NOT NULL,
  `meta_keywords` varchar(128) NOT NULL,
  `title_tag` varchar(128) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `pid` (`pid`),
  KEY `hidelevel` (`hidelevel`),
  KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 PACK_KEYS=1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_group`
--

LOCK TABLES `doc_group` WRITE;
/*!40000 ALTER TABLE `doc_group` DISABLE KEYS */;
INSERT INTO `doc_group` VALUES (1,'Товары','',0,0,'',0,'','',''),(2,'Услуги','',0,0,'',0,'','','');
/*!40000 ALTER TABLE `doc_group` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_group_cost`
--

DROP TABLE IF EXISTS `doc_group_cost`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_group_cost` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `group_id` int(11) NOT NULL,
  `cost_id` int(11) NOT NULL,
  `type` varchar(5) NOT NULL,
  `value` decimal(8,2) NOT NULL,
  `accuracy` tinyint(4) NOT NULL,
  `direction` tinyint(4) NOT NULL,
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `uniq` (`group_id`,`cost_id`),
  KEY `group_id` (`group_id`),
  KEY `cost_id` (`cost_id`),
  KEY `value` (`value`),
  KEY `type` (`type`),
  CONSTRAINT `doc_group_cost_ibfk_1` FOREIGN KEY (`group_id`) REFERENCES `doc_group` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `doc_group_cost_ibfk_2` FOREIGN KEY (`cost_id`) REFERENCES `doc_cost` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_group_cost`
--

LOCK TABLES `doc_group_cost` WRITE;
/*!40000 ALTER TABLE `doc_group_cost` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_group_cost` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_group_params`
--

DROP TABLE IF EXISTS `doc_group_params`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_group_params` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `group_id` int(11) DEFAULT NULL,
  `param_id` int(11) DEFAULT NULL,
  `show_in_filter` tinyint(4) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uniq` (`group_id`,`param_id`),
  KEY `fk_doc_group_params_doc_group1` (`group_id`),
  KEY `fk_doc_group_params_doc_base_params1` (`param_id`),
  KEY `show_in_filter` (`show_in_filter`),
  CONSTRAINT `fk_doc_group_params_doc_base_params1` FOREIGN KEY (`param_id`) REFERENCES `doc_base_params` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `fk_doc_group_params_doc_group1` FOREIGN KEY (`group_id`) REFERENCES `doc_group` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_group_params`
--

LOCK TABLES `doc_group_params` WRITE;
/*!40000 ALTER TABLE `doc_group_params` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_group_params` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_img`
--

DROP TABLE IF EXISTS `doc_img`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_img` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `type` varchar(4) NOT NULL,
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_img`
--

LOCK TABLES `doc_img` WRITE;
/*!40000 ALTER TABLE `doc_img` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_img` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_kassa`
--

DROP TABLE IF EXISTS `doc_kassa`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_kassa` (
  `ids` varchar(50) CHARACTER SET latin1 NOT NULL,
  `num` int(11) NOT NULL,
  `name` varchar(50) NOT NULL,
  `ballance` decimal(10,2) NOT NULL,
  `bik` varchar(20) NOT NULL,
  `rs` varchar(30) NOT NULL,
  `ks` varchar(30) NOT NULL,
  `firm_id` int(11) DEFAULT NULL,
  UNIQUE KEY `ids` (`ids`,`num`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_kassa`
--

LOCK TABLES `doc_kassa` WRITE;
/*!40000 ALTER TABLE `doc_kassa` DISABLE KEYS */;
INSERT INTO `doc_kassa` VALUES ('bank',1,'OАО НОВОСИБИРСКИЙ ФИЛИАЛ \"БАНКА\"',0.00,'','','',NULL),('kassa',1,'Основная касса',0.00,'','','',NULL);
/*!40000 ALTER TABLE `doc_kassa` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_list`
--

DROP TABLE IF EXISTS `doc_list`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_list` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` tinyint(4) NOT NULL DEFAULT '0',
  `agent` int(11) NOT NULL DEFAULT '0',
  `contract` int(11) DEFAULT NULL COMMENT 'Номер договора',
  `comment` text NOT NULL,
  `date` bigint(20) NOT NULL DEFAULT '0',
  `created` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `ok` bigint(20) NOT NULL DEFAULT '0',
  `sklad` tinyint(4) NOT NULL DEFAULT '0',
  `kassa` tinyint(4) NOT NULL DEFAULT '0',
  `bank` tinyint(4) NOT NULL DEFAULT '0',
  `user` int(11) NOT NULL DEFAULT '0',
  `altnum` int(11) NOT NULL,
  `subtype` varchar(5) NOT NULL,
  `sum` decimal(10,2) NOT NULL DEFAULT '0.00',
  `nds` int(11) NOT NULL DEFAULT '0',
  `p_doc` int(11) NOT NULL,
  `mark_del` bigint(20) NOT NULL,
  `firm_id` int(11) NOT NULL DEFAULT '1',
  `err_flag` tinyint(4) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `type` (`type`),
  KEY `fio` (`agent`),
  KEY `date` (`date`),
  KEY `altnum` (`altnum`),
  KEY `p_doc` (`p_doc`),
  KEY `ok` (`ok`),
  KEY `sklad` (`sklad`),
  KEY `user` (`user`),
  KEY `subtype` (`subtype`),
  KEY `mark_del` (`mark_del`),
  KEY `firm_id` (`firm_id`),
  KEY `kassa` (`kassa`,`bank`),
  KEY `contract` (`contract`),
  KEY `created` (`created`),
  KEY `agent` (`agent`),
  CONSTRAINT `doc_list_ibfk_1` FOREIGN KEY (`firm_id`) REFERENCES `doc_vars` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_list`
--

LOCK TABLES `doc_list` WRITE;
/*!40000 ALTER TABLE `doc_list` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_list` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_list_pos`
--

DROP TABLE IF EXISTS `doc_list_pos`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_list_pos` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `doc` int(11) NOT NULL DEFAULT '0',
  `tovar` int(11) NOT NULL DEFAULT '0',
  `cnt` int(11) NOT NULL DEFAULT '0',
  `gtd` varchar(32) NOT NULL,
  `comm` varchar(50) NOT NULL,
  `cost` decimal(10,2) NOT NULL DEFAULT '0.00',
  `page` int(11) NOT NULL DEFAULT '0',
  KEY `id` (`id`),
  KEY `doc` (`doc`),
  KEY `tovar` (`tovar`),
  KEY `sklad` (`page`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_list_pos`
--

LOCK TABLES `doc_list_pos` WRITE;
/*!40000 ALTER TABLE `doc_list_pos` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_list_pos` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_list_sn`
--

DROP TABLE IF EXISTS `doc_list_sn`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_list_sn` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pos_id` int(11) NOT NULL COMMENT 'ID товара',
  `num` varchar(64) NOT NULL COMMENT 'Серийный номер',
  `prix_list_pos` int(11) NOT NULL COMMENT 'Строка поступления',
  `rasx_list_pos` int(11) DEFAULT NULL COMMENT 'Строка реализации',
  UNIQUE KEY `id` (`id`),
  KEY `pos_id` (`pos_id`),
  KEY `num` (`num`),
  KEY `prix_list_pos` (`prix_list_pos`),
  KEY `rasx_list_pos` (`rasx_list_pos`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Серийные номера';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_list_sn`
--

LOCK TABLES `doc_list_sn` WRITE;
/*!40000 ALTER TABLE `doc_list_sn` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_list_sn` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_log`
--

DROP TABLE IF EXISTS `doc_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user` int(11) NOT NULL,
  `ip` varchar(20) NOT NULL,
  `object` varchar(20) NOT NULL,
  `object_id` int(11) NOT NULL,
  `motion` varchar(100) NOT NULL,
  `desc` varchar(500) NOT NULL,
  `time` datetime NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `user` (`user`),
  KEY `motion` (`motion`),
  KEY `time` (`time`),
  KEY `ip` (`ip`),
  KEY `object` (`object`),
  KEY `object_id` (`object_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_log`
--

LOCK TABLES `doc_log` WRITE;
/*!40000 ALTER TABLE `doc_log` DISABLE KEYS */;
/*!40000 ALTER TABLE `doc_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_sklady`
--

DROP TABLE IF EXISTS `doc_sklady`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_sklady` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `comment` text NOT NULL,
  `dnc` tinyint(4) NOT NULL,
  `firm_id` int(11) DEFAULT NULL,
  KEY `id` (`id`),
  KEY `name` (`name`),
  KEY `firm_id` (`firm_id`),
  CONSTRAINT `doc_sklady_ibfk_3` FOREIGN KEY (`firm_id`) REFERENCES `doc_vars` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `doc_sklady_ibfk_1` FOREIGN KEY (`firm_id`) REFERENCES `doc_vars` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  CONSTRAINT `doc_sklady_ibfk_2` FOREIGN KEY (`firm_id`) REFERENCES `doc_vars` (`id`) ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_sklady`
--

LOCK TABLES `doc_sklady` WRITE;
/*!40000 ALTER TABLE `doc_sklady` DISABLE KEYS */;
INSERT INTO `doc_sklady` VALUES (1,'Основной склад','',0,NULL);
/*!40000 ALTER TABLE `doc_sklady` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_types`
--

DROP TABLE IF EXISTS `doc_types`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_types` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(30) NOT NULL,
  KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8 PACK_KEYS=0;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_types`
--

LOCK TABLES `doc_types` WRITE;
/*!40000 ALTER TABLE `doc_types` DISABLE KEYS */;
INSERT INTO `doc_types` VALUES (1,'Поступление'),(2,'Реализация'),(3,'Заявка покупателя'),(4,'Банк - приход'),(5,'Банк - расход'),(6,'Касса - приход'),(7,'Касса - расход'),(8,'Перемещение товара'),(9,'Перемещение средств (касса)'),(10,'Доверенность'),(11,'Предложение поставщика'),(12,'Товар в пути'),(13,'Коммерческое предложение'),(14,'Договор'),(15,'Реализация (оперативная)'),(16,'Спецификация'),(19,'Корректировка бонусов'),(20,'Реализация за бонусы'),(21,'Заявка на производство');
/*!40000 ALTER TABLE `doc_types` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `doc_vars`
--

DROP TABLE IF EXISTS `doc_vars`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `doc_vars` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `firm_name` varchar(150) NOT NULL,
  `firm_director` varchar(100) NOT NULL,
  `firm_director_r` varchar(100) NOT NULL,
  `firm_manager` varchar(100) NOT NULL,
  `firm_buhgalter` varchar(100) NOT NULL,
  `firm_kladovshik_doljn` varchar(128) NOT NULL,
  `firm_kladovshik` varchar(100) NOT NULL,
  `firm_kladovshik_id` int(11) NOT NULL,
  `firm_bank` varchar(100) NOT NULL,
  `firm_bank_kor_s` varchar(25) NOT NULL,
  `firm_bik` varchar(15) NOT NULL,
  `firm_schet` varchar(25) NOT NULL,
  `firm_inn` varchar(25) NOT NULL,
  `firm_adres` varchar(150) NOT NULL,
  `firm_realadres` varchar(150) NOT NULL,
  `firm_gruzootpr` varchar(300) NOT NULL,
  `firm_telefon` varchar(60) NOT NULL,
  `firm_okpo` varchar(10) NOT NULL,
  `param_nds` double NOT NULL DEFAULT '0',
  `firm_skin` varchar(16) NOT NULL,
  `firm_store_lock` smallint(6) NOT NULL COMMENT 'Списание только со своих складов',
  `firm_bank_lock` smallint(6) NOT NULL COMMENT 'Работать только со своими банками',
  `firm_till_lock` smallint(6) NOT NULL COMMENT 'Работать только со своими кассами',
  UNIQUE KEY `id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `doc_vars`
--

LOCK TABLES `doc_vars` WRITE;
/*!40000 ALTER TABLE `doc_vars` DISABLE KEYS */;
INSERT INTO `doc_vars` VALUES (5,'ООО РиК','Иванов И.И.','Иванов И.И.','Иванов И.И.','Иванов И.И.','Кладовщик','Иванов И.И.',1,'','','','','','г. Старый, ул Новая 1ы','','','+833254587','',0,'',0,0,0);
/*!40000 ALTER TABLE `doc_vars` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `errorlog`
--

DROP TABLE IF EXISTS `errorlog`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `errorlog` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `page` varchar(128) NOT NULL,
  `referer` varchar(128) NOT NULL,
  `class` varchar(64) NOT NULL,
  `code` int(11) NOT NULL,
  `msg` text NOT NULL,
  `file` varchar(128) NOT NULL,
  `line` int(11) NOT NULL,
  `trace` text NOT NULL,
  `date` datetime NOT NULL,
  `ip` varchar(18) NOT NULL,
  `useragent` varchar(256) NOT NULL,
  `uid` int(11) DEFAULT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `errorlog`
--

LOCK TABLES `errorlog` WRITE;
/*!40000 ALTER TABLE `errorlog` DISABLE KEYS */;
/*!40000 ALTER TABLE `errorlog` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `factory_builders`
--

DROP TABLE IF EXISTS `factory_builders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `factory_builders` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) NOT NULL,
  `active` tinyint(4) NOT NULL,
  `store_id` int(11) DEFAULT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `store_id` (`store_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `factory_builders`
--

LOCK TABLES `factory_builders` WRITE;
/*!40000 ALTER TABLE `factory_builders` DISABLE KEYS */;
/*!40000 ALTER TABLE `factory_builders` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `factory_data`
--

DROP TABLE IF EXISTS `factory_data`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `factory_data` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `sklad_id` int(11) NOT NULL,
  `builder_id` int(11) NOT NULL,
  `date` date NOT NULL,
  `pos_id` int(11) NOT NULL,
  `cnt` int(11) NOT NULL,
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `uni` (`sklad_id`,`builder_id`,`date`,`pos_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `factory_data`
--

LOCK TABLES `factory_data` WRITE;
/*!40000 ALTER TABLE `factory_data` DISABLE KEYS */;
/*!40000 ALTER TABLE `factory_data` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `firm_info`
--

DROP TABLE IF EXISTS `firm_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `firm_info` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL DEFAULT '',
  `signature` varchar(200) NOT NULL DEFAULT '' COMMENT 'Сигнатура для определения принадлежности прайса',
  `currency` tinyint(4) NOT NULL,
  `coeff` decimal(10,3) NOT NULL,
  `last_update` datetime NOT NULL,
  `type` int(11) NOT NULL COMMENT 'Как интерпретировать прайс фирмы',
  `delivery_info` varchar(16) NOT NULL COMMENT 'Информация о доставке',
  `rrp` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`),
  UNIQUE KEY `signature` (`signature`),
  KEY `delivery_info` (`delivery_info`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `firm_info`
--

LOCK TABLES `firm_info` WRITE;
/*!40000 ALTER TABLE `firm_info` DISABLE KEYS */;
/*!40000 ALTER TABLE `firm_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `firm_info_group`
--

DROP TABLE IF EXISTS `firm_info_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `firm_info_group` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `firm_id` int(11) NOT NULL,
  `group_id` int(11) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `firm_id` (`firm_id`),
  KEY `group_id` (`group_id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `firm_info_group`
--

LOCK TABLES `firm_info_group` WRITE;
/*!40000 ALTER TABLE `firm_info_group` DISABLE KEYS */;
/*!40000 ALTER TABLE `firm_info_group` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `firm_info_struct`
--

DROP TABLE IF EXISTS `firm_info_struct`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `firm_info_struct` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `firm_id` int(11) NOT NULL COMMENT 'Номер фирмы',
  `table_name` varchar(50) NOT NULL COMMENT 'Название листа прайса',
  `name` mediumint(9) NOT NULL COMMENT 'N колонки наименований',
  `cost` mediumint(9) NOT NULL,
  `art` mediumint(9) NOT NULL,
  `nal` mediumint(9) NOT NULL,
  `currency` int(11) NOT NULL,
  `info` mediumint(9) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `firm_id` (`firm_id`),
  KEY `table_name` (`table_name`),
  KEY `currency` (`currency`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `firm_info_struct`
--

LOCK TABLES `firm_info_struct` WRITE;
/*!40000 ALTER TABLE `firm_info_struct` DISABLE KEYS */;
/*!40000 ALTER TABLE `firm_info_struct` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `log_call_requests`
--

DROP TABLE IF EXISTS `log_call_requests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `log_call_requests` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(64) NOT NULL,
  `phone` varchar(32) NOT NULL,
  `request_date` datetime NOT NULL,
  `call_date` varchar(32) NOT NULL,
  `ip` varchar(32) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `log_call_requests`
--

LOCK TABLES `log_call_requests` WRITE;
/*!40000 ALTER TABLE `log_call_requests` DISABLE KEYS */;
/*!40000 ALTER TABLE `log_call_requests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `news`
--

DROP TABLE IF EXISTS `news`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type` varchar(8) NOT NULL,
  `title` varchar(64) NOT NULL,
  `text` text NOT NULL,
  `date` datetime NOT NULL,
  `autor` int(11) NOT NULL,
  `ex_date` date NOT NULL,
  `img_ext` varchar(4) NOT NULL,
  `hidden` tinyint(4) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `type` (`type`),
  KEY `ex_date` (`ex_date`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `news`
--

LOCK TABLES `news` WRITE;
/*!40000 ALTER TABLE `news` DISABLE KEYS */;
/*!40000 ALTER TABLE `news` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `parsed_price`
--

DROP TABLE IF EXISTS `parsed_price`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `parsed_price` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `firm` int(11) NOT NULL,
  `pos` int(11) NOT NULL,
  `cost` decimal(10,2) NOT NULL,
  `nal` varchar(10) NOT NULL,
  `from` int(11) NOT NULL,
  `selected` tinyint(4) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `firm` (`firm`),
  KEY `pos` (`pos`),
  KEY `cost` (`cost`),
  KEY `nal` (`nal`),
  KEY `from` (`from`),
  KEY `selected` (`selected`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `parsed_price`
--

LOCK TABLES `parsed_price` WRITE;
/*!40000 ALTER TABLE `parsed_price` DISABLE KEYS */;
/*!40000 ALTER TABLE `parsed_price` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `photogalery`
--

DROP TABLE IF EXISTS `photogalery`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `photogalery` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL DEFAULT '0',
  `comment` varchar(50) NOT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `photogalery`
--

LOCK TABLES `photogalery` WRITE;
/*!40000 ALTER TABLE `photogalery` DISABLE KEYS */;
/*!40000 ALTER TABLE `photogalery` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `price`
--

DROP TABLE IF EXISTS `price`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `price` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(1024) NOT NULL DEFAULT '',
  `cost` double NOT NULL DEFAULT '0',
  `firm` int(11) NOT NULL DEFAULT '0',
  `art` varchar(20) NOT NULL DEFAULT '',
  `nal` varchar(20) NOT NULL,
  `info` varchar(128) NOT NULL,
  `date` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `seeked` int(11) NOT NULL,
  `currency` int(11) NOT NULL,
  KEY `cost` (`cost`),
  KEY `firm` (`firm`),
  KEY `art` (`art`),
  KEY `date` (`date`),
  KEY `id` (`id`),
  KEY `name` (`name`(333))
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `price`
--

LOCK TABLES `price` WRITE;
/*!40000 ALTER TABLE `price` DISABLE KEYS */;
/*!40000 ALTER TABLE `price` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `price_seeked`
--

DROP TABLE IF EXISTS `price_seeked`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `price_seeked` (
  `id` int(11) NOT NULL,
  `seeked` int(11) NOT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=MEMORY DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `price_seeked`
--

LOCK TABLES `price_seeked` WRITE;
/*!40000 ALTER TABLE `price_seeked` DISABLE KEYS */;
/*!40000 ALTER TABLE `price_seeked` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `prices_replaces`
--

DROP TABLE IF EXISTS `prices_replaces`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `prices_replaces` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `search_str` varchar(16) NOT NULL,
  `replace_str` varchar(512) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `search_str` (`search_str`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='Список замен для регулярных выражений анализатора прайсов';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `prices_replaces`
--

LOCK TABLES `prices_replaces` WRITE;
/*!40000 ALTER TABLE `prices_replaces` DISABLE KEYS */;
/*!40000 ALTER TABLE `prices_replaces` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ps_counter`
--

DROP TABLE IF EXISTS `ps_counter`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_counter` (
  `date` date NOT NULL DEFAULT '1970-01-01',
  `query` int(11) NOT NULL DEFAULT '0',
  `ps` int(11) NOT NULL DEFAULT '0',
  `counter` int(11) NOT NULL,
  PRIMARY KEY (`date`,`query`,`ps`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_counter`
--

LOCK TABLES `ps_counter` WRITE;
/*!40000 ALTER TABLE `ps_counter` DISABLE KEYS */;
/*!40000 ALTER TABLE `ps_counter` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ps_parser`
--

DROP TABLE IF EXISTS `ps_parser`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_parser` (
  `parametr` varchar(24) NOT NULL,
  `data` varchar(64) NOT NULL DEFAULT '0',
  PRIMARY KEY (`parametr`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_parser`
--

LOCK TABLES `ps_parser` WRITE;
/*!40000 ALTER TABLE `ps_parser` DISABLE KEYS */;
INSERT INTO `ps_parser` VALUES ('last_time_counter','0');
/*!40000 ALTER TABLE `ps_parser` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ps_query`
--

DROP TABLE IF EXISTS `ps_query`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_query` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `query` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_query`
--

LOCK TABLES `ps_query` WRITE;
/*!40000 ALTER TABLE `ps_query` DISABLE KEYS */;
/*!40000 ALTER TABLE `ps_query` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ps_settings`
--

DROP TABLE IF EXISTS `ps_settings`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ps_settings` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `icon` varchar(4) NOT NULL,
  `name` varchar(16) NOT NULL,
  `template` varchar(128) NOT NULL,
  `template_like` varchar(64) NOT NULL,
  `prioritet` tinyint(4) NOT NULL DEFAULT '1',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ps_settings`
--

LOCK TABLES `ps_settings` WRITE;
/*!40000 ALTER TABLE `ps_settings` DISABLE KEYS */;
INSERT INTO `ps_settings` VALUES (1,'Y','yandex','/.*?yandex.*?text=[\\.\\s]*([-a-zа-я0-9\"\'_!?()\\/\\\\:;]+[-a-zа-я0-9.\\s,\"\'_!?()\\/\\\\:;]*).*[\\.\\s]*($|&.*)/ui','%yandex%text=%',1),(2,'G','google','/.*?google.*?q=[\\.\\s]*([-a-zа-я0-9\"\'_!?()\\/\\\\:;]+[-a-zа-я0-9.\\s,\"\'_!?()\\/\\\\:;]*).*[\\.\\s]*($|&.*)/ui','%google%q=%',2),(3,'M','mail','/.*?mail.*?q=[\\.\\s]*([-a-zа-я0-9\"\'_!?()\\/\\\\:;]+[-a-zа-я0-9.\\s,\"\'_!?()\\/\\\\:;]*).*[\\.\\s]*($|&.*)/ui','%mail%q=%',3),(4,'R','rambler','/.*?rambler.*?query=[\\.\\s]*([-a-zа-я0-9\"\'_!?()\\/\\\\:;]+[-a-zа-я0-9.\\s,\"\'_!?()\\/\\\\:;]*).*[\\.\\s]*($|&.*)/ui','%rambler%query=%',4),(5,'B','bing','/.*?bing.*?q=[\\.\\s]*([-a-zа-я0-9\"\'_!?()\\/\\\\:;]+[-a-zа-я0-9.\\s,\"\'_!?()\\/\\\\:;]*).*[\\.\\s]*($|&.*)/ui','%bing%q=%',5),(6,'Q','qip','/.*?qip.*?query=[\\.\\s]*([-a-zа-я0-9\"\'_!?()\\/\\\\:;]+[-a-zа-я0-9.\\s,\"\'_!?()\\/\\\\:;]*).*[\\.\\s]*($|&.*)/ui','%qip%query=%',6),(7,'N','ngs','/.*?ngs.*?q=[\\.\\s]*([-a-zа-я0-9\"\'_!?()\\/\\\\:;]+[-a-zа-я0-9.\\s,\"\'_!?()\\/\\\\:;]*).*[\\.\\s]*($|&.*)/ui','%ngs%q=%',7);
/*!40000 ALTER TABLE `ps_settings` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `seekdata`
--

DROP TABLE IF EXISTS `seekdata`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `seekdata` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(128) NOT NULL,
  `sql` varchar(200) NOT NULL,
  `regex` varchar(256) NOT NULL,
  `group` int(11) NOT NULL,
  `regex_neg` varchar(256) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `name` (`name`),
  KEY `sql` (`sql`),
  KEY `regex` (`regex`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `seekdata`
--

LOCK TABLES `seekdata` WRITE;
/*!40000 ALTER TABLE `seekdata` DISABLE KEYS */;
/*!40000 ALTER TABLE `seekdata` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `survey`
--

DROP TABLE IF EXISTS `survey`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `survey` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(128) NOT NULL,
  `start_date` date NOT NULL,
  `end_date` date NOT NULL,
  `start_text` text NOT NULL,
  `end_text` text NOT NULL,
  PRIMARY KEY (`id`),
  KEY `start_date` (`start_date`),
  KEY `end_date` (`end_date`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `survey`
--

LOCK TABLES `survey` WRITE;
/*!40000 ALTER TABLE `survey` DISABLE KEYS */;
/*!40000 ALTER TABLE `survey` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `survey_answer`
--

DROP TABLE IF EXISTS `survey_answer`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `survey_answer` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `survey_id` int(11) NOT NULL,
  `question_num` int(11) NOT NULL,
  `answer_txt` varchar(64) NOT NULL,
  `answer_int` int(11) NOT NULL,
  `comment` varchar(256) NOT NULL,
  `uid` int(11) DEFAULT NULL,
  `ip_address` varchar(32) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uniq` (`survey_id`,`question_num`,`uid`,`ip_address`),
  KEY `survey_id` (`survey_id`),
  KEY `question_id` (`question_num`),
  KEY `uid` (`uid`),
  KEY `ip_addres` (`ip_address`),
  CONSTRAINT `survey_answer_ibfk_1` FOREIGN KEY (`survey_id`) REFERENCES `survey` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `survey_answer_ibfk_3` FOREIGN KEY (`uid`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL,
  CONSTRAINT `survey_answer_ibfk_4` FOREIGN KEY (`question_num`) REFERENCES `survey_question` (`question_num`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=54 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `survey_answer`
--

LOCK TABLES `survey_answer` WRITE;
/*!40000 ALTER TABLE `survey_answer` DISABLE KEYS */;
/*!40000 ALTER TABLE `survey_answer` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `survey_ok`
--

DROP TABLE IF EXISTS `survey_ok`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `survey_ok` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `survey_id` int(11) NOT NULL,
  `uid` int(11) DEFAULT NULL,
  `ip` varchar(32) NOT NULL,
  `result` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `survey_id` (`survey_id`),
  KEY `uid` (`uid`),
  KEY `ip` (`ip`),
  CONSTRAINT `survey_ok_ibfk_1` FOREIGN KEY (`survey_id`) REFERENCES `survey` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `survey_ok_ibfk_2` FOREIGN KEY (`uid`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `survey_ok`
--

LOCK TABLES `survey_ok` WRITE;
/*!40000 ALTER TABLE `survey_ok` DISABLE KEYS */;
/*!40000 ALTER TABLE `survey_ok` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `survey_quest_option`
--

DROP TABLE IF EXISTS `survey_quest_option`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `survey_quest_option` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `survey_id` int(11) NOT NULL,
  `question_id` int(11) NOT NULL,
  `option_num` int(11) NOT NULL,
  `text` varchar(128) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uniq` (`survey_id`,`question_id`,`option_num`),
  KEY `survey_id` (`survey_id`),
  KEY `question_id` (`question_id`),
  KEY `num` (`option_num`),
  CONSTRAINT `survey_quest_option_ibfk_1` FOREIGN KEY (`survey_id`) REFERENCES `survey` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `survey_quest_option_ibfk_2` FOREIGN KEY (`question_id`) REFERENCES `survey_question` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `survey_quest_option`
--

LOCK TABLES `survey_quest_option` WRITE;
/*!40000 ALTER TABLE `survey_quest_option` DISABLE KEYS */;
/*!40000 ALTER TABLE `survey_quest_option` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `survey_question`
--

DROP TABLE IF EXISTS `survey_question`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `survey_question` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `survey_id` int(11) NOT NULL,
  `question_num` int(11) NOT NULL,
  `text` varchar(256) NOT NULL,
  `type` tinyint(4) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `survey_id` (`survey_id`),
  KEY `question_num` (`question_num`),
  CONSTRAINT `survey_question_ibfk_1` FOREIGN KEY (`survey_id`) REFERENCES `survey` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `survey_question`
--

LOCK TABLES `survey_question` WRITE;
/*!40000 ALTER TABLE `survey_question` DISABLE KEYS */;
/*!40000 ALTER TABLE `survey_question` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tickets`
--

DROP TABLE IF EXISTS `tickets`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tickets` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `date` datetime NOT NULL,
  `autor` int(11) NOT NULL,
  `priority` tinyint(4) NOT NULL,
  `theme` varchar(100) NOT NULL,
  `text` text NOT NULL,
  `to_date` date NOT NULL,
  `state` tinyint(4) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `date` (`date`),
  KEY `autor` (`autor`),
  KEY `theme` (`theme`),
  KEY `to_date` (`to_date`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tickets`
--

LOCK TABLES `tickets` WRITE;
/*!40000 ALTER TABLE `tickets` DISABLE KEYS */;
/*!40000 ALTER TABLE `tickets` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tickets_log`
--

DROP TABLE IF EXISTS `tickets_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tickets_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `ticket` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `text` text NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `uid` (`uid`,`ticket`,`date`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tickets_log`
--

LOCK TABLES `tickets_log` WRITE;
/*!40000 ALTER TABLE `tickets_log` DISABLE KEYS */;
/*!40000 ALTER TABLE `tickets_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tickets_priority`
--

DROP TABLE IF EXISTS `tickets_priority`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tickets_priority` (
  `id` tinyint(4) NOT NULL,
  `name` varchar(50) NOT NULL,
  `color` varchar(6) NOT NULL,
  `comment` varchar(200) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `name` (`name`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tickets_priority`
--

LOCK TABLES `tickets_priority` WRITE;
/*!40000 ALTER TABLE `tickets_priority` DISABLE KEYS */;
INSERT INTO `tickets_priority` VALUES (-3,'Не важный','aaa',''),(-2,'Незначительный','0bd',''),(-1,'Низкий','55f',''),(0,'Обычный','0a0',''),(1,'Важный','b0b',''),(2,'Срочный','f92',''),(3,'Критический','f00','');
/*!40000 ALTER TABLE `tickets_priority` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tickets_responsibles`
--

DROP TABLE IF EXISTS `tickets_responsibles`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tickets_responsibles` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ticket_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uni` (`ticket_id`,`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tickets_responsibles`
--

LOCK TABLES `tickets_responsibles` WRITE;
/*!40000 ALTER TABLE `tickets_responsibles` DISABLE KEYS */;
/*!40000 ALTER TABLE `tickets_responsibles` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `tickets_state`
--

DROP TABLE IF EXISTS `tickets_state`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `tickets_state` (
  `id` int(11) NOT NULL,
  `name` varchar(30) NOT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `tickets_state`
--

LOCK TABLES `tickets_state` WRITE;
/*!40000 ALTER TABLE `tickets_state` DISABLE KEYS */;
INSERT INTO `tickets_state` VALUES (0,'Новый'),(1,'В процессе'),(2,'Ошибочный'),(3,'Готово');
/*!40000 ALTER TABLE `tickets_state` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `traffic_denyip`
--

DROP TABLE IF EXISTS `traffic_denyip`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `traffic_denyip` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ip` varchar(20) NOT NULL,
  `host` varchar(50) NOT NULL,
  UNIQUE KEY `id_2` (`id`),
  UNIQUE KEY `ip` (`ip`)
) ENGINE=MyISAM DEFAULT CHARSET=latin1 COMMENT='Zapreshennie IP';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `traffic_denyip`
--

LOCK TABLES `traffic_denyip` WRITE;
/*!40000 ALTER TABLE `traffic_denyip` DISABLE KEYS */;
/*!40000 ALTER TABLE `traffic_denyip` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ulog`
--

DROP TABLE IF EXISTS `ulog`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ulog` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `raw_mac` varchar(80) DEFAULT NULL,
  `oob_time_sec` int(10) unsigned DEFAULT NULL,
  `oob_time_usec` int(10) unsigned DEFAULT NULL,
  `oob_prefix` varchar(32) DEFAULT NULL,
  `oob_mark` int(10) unsigned DEFAULT NULL,
  `oob_in` varchar(32) DEFAULT NULL,
  `oob_out` varchar(32) DEFAULT NULL,
  `ip_saddr` varchar(15) DEFAULT NULL,
  `ip_daddr` varchar(15) DEFAULT NULL,
  `ip_protocol` tinyint(3) unsigned DEFAULT NULL,
  `ip_tos` tinyint(3) unsigned DEFAULT NULL,
  `ip_ttl` tinyint(3) unsigned DEFAULT NULL,
  `ip_totlen` smallint(5) unsigned DEFAULT NULL,
  `ip_ihl` tinyint(3) unsigned DEFAULT NULL,
  `ip_csum` smallint(5) unsigned DEFAULT NULL,
  `ip_id` smallint(5) unsigned DEFAULT NULL,
  `ip_fragoff` smallint(5) unsigned DEFAULT NULL,
  `tcp_sport` smallint(5) unsigned DEFAULT NULL,
  `tcp_dport` smallint(5) unsigned DEFAULT NULL,
  `tcp_seq` int(10) unsigned DEFAULT NULL,
  `tcp_ackseq` int(10) unsigned DEFAULT NULL,
  `tcp_window` smallint(5) unsigned DEFAULT NULL,
  `tcp_urg` tinyint(4) DEFAULT NULL,
  `tcp_urgp` smallint(5) unsigned DEFAULT NULL,
  `tcp_ack` tinyint(4) DEFAULT NULL,
  `tcp_psh` tinyint(4) DEFAULT NULL,
  `tcp_rst` tinyint(4) DEFAULT NULL,
  `tcp_syn` tinyint(4) DEFAULT NULL,
  `tcp_fin` tinyint(4) DEFAULT NULL,
  `udp_sport` smallint(5) unsigned DEFAULT NULL,
  `udp_dport` smallint(5) unsigned DEFAULT NULL,
  `udp_len` smallint(5) unsigned DEFAULT NULL,
  `icmp_type` tinyint(3) unsigned DEFAULT NULL,
  `icmp_code` tinyint(3) unsigned DEFAULT NULL,
  `icmp_echoid` smallint(5) unsigned DEFAULT NULL,
  `icmp_echoseq` smallint(5) unsigned DEFAULT NULL,
  `icmp_gateway` int(10) unsigned DEFAULT NULL,
  `icmp_fragmtu` smallint(5) unsigned DEFAULT NULL,
  `pwsniff_user` varchar(30) DEFAULT NULL,
  `pwsniff_pass` varchar(30) DEFAULT NULL,
  `ahesp_spi` int(10) unsigned DEFAULT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `ip_daddr` (`ip_daddr`),
  KEY `ip_saddr` (`ip_saddr`)
) ENGINE=MyISAM DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ulog`
--

LOCK TABLES `ulog` WRITE;
/*!40000 ALTER TABLE `ulog` DISABLE KEYS */;
/*!40000 ALTER TABLE `ulog` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) NOT NULL,
  `pass` varchar(192) NOT NULL,
  `pass_type` varchar(8) NOT NULL COMMENT 'тип хэша',
  `reg_email` varchar(64) NOT NULL,
  `reg_email_confirm` varchar(16) NOT NULL,
  `reg_email_subscribe` tinyint(4) NOT NULL,
  `reg_phone` varchar(16) NOT NULL,
  `reg_phone_subscribe` tinyint(4) NOT NULL,
  `reg_phone_confirm` varchar(8) NOT NULL,
  `reg_date` datetime NOT NULL,
  `disabled` tinyint(4) NOT NULL DEFAULT '0',
  `disabled_reason` varchar(128) NOT NULL,
  `bifact_auth` tinyint(4) NOT NULL DEFAULT '0',
  `real_name` varchar(64) NOT NULL,
  `real_address` varchar(256) NOT NULL,
  `pass_change` varchar(64) NOT NULL,
  `pass_expired` tinyint(4) NOT NULL DEFAULT '0',
  `pass_date_change` datetime NOT NULL,
  `jid` varchar(40) NOT NULL,
  `type` varchar(4) NOT NULL COMMENT 'физ/юр',
  `agent_id` int(11) DEFAULT NULL,
  UNIQUE KEY `name` (`name`),
  KEY `id` (`id`),
  KEY `name_2` (`name`),
  KEY `reg_email` (`reg_email`),
  KEY `reg_email_confirm` (`reg_email_confirm`),
  KEY `reg_phone` (`reg_phone`),
  KEY `reg_phone_confirm` (`reg_phone_confirm`),
  KEY `pass_date_change` (`pass_date_change`),
  KEY `pass_expired` (`pass_expired`),
  KEY `disabled` (`disabled`),
  KEY `reg_email_subscribe` (`reg_email_subscribe`),
  KEY `reg_phone_subscribe` (`reg_phone_subscribe`),
  KEY `jid` (`jid`),
  KEY `agent_id` (`agent_id`)
) ENGINE=InnoDB AUTO_INCREMENT=1210 DEFAULT CHARSET=utf8 PACK_KEYS=1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_acl`
--

DROP TABLE IF EXISTS `users_acl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_acl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `object` varchar(64) NOT NULL,
  `action` varchar(16) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `uid` (`uid`),
  KEY `object` (`object`),
  KEY `action` (`action`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_acl`
--

LOCK TABLES `users_acl` WRITE;
/*!40000 ALTER TABLE `users_acl` DISABLE KEYS */;
/*!40000 ALTER TABLE `users_acl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_bad_auth`
--

DROP TABLE IF EXISTS `users_bad_auth`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_bad_auth` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ip` varchar(24) NOT NULL,
  `time` double NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `ip` (`ip`),
  KEY `date` (`time`)
) ENGINE=MyISAM DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_bad_auth`
--

LOCK TABLES `users_bad_auth` WRITE;
/*!40000 ALTER TABLE `users_bad_auth` DISABLE KEYS */;
/*!40000 ALTER TABLE `users_bad_auth` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_basket`
--

DROP TABLE IF EXISTS `users_basket`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_basket` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `pos_id` int(11) NOT NULL,
  `cnt` int(11) NOT NULL,
  `comment` varchar(128) NOT NULL,
  UNIQUE KEY `id` (`id`),
  UNIQUE KEY `uni` (`user_id`,`pos_id`),
  KEY `user_id` (`user_id`),
  KEY `pos_id` (`pos_id`),
  CONSTRAINT `users_basket_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `users_basket_ibfk_2` FOREIGN KEY (`pos_id`) REFERENCES `doc_base` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=162 DEFAULT CHARSET=utf8 COMMENT='Сохранённые корзины пользователей';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_basket`
--

LOCK TABLES `users_basket` WRITE;
/*!40000 ALTER TABLE `users_basket` DISABLE KEYS */;
/*!40000 ALTER TABLE `users_basket` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_data`
--

DROP TABLE IF EXISTS `users_data`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_data` (
  `uid` int(11) NOT NULL DEFAULT '0',
  `param` varchar(25) NOT NULL,
  `value` varchar(100) CHARACTER SET utf8 NOT NULL,
  UNIQUE KEY `uid` (`uid`,`param`),
  KEY `value` (`value`)
) ENGINE=MyISAM DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_data`
--

LOCK TABLES `users_data` WRITE;
/*!40000 ALTER TABLE `users_data` DISABLE KEYS */;
/*!40000 ALTER TABLE `users_data` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_grouplist`
--

DROP TABLE IF EXISTS `users_grouplist`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_grouplist` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `comment` text NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `name` (`name`)
) ENGINE=MyISAM AUTO_INCREMENT=7 DEFAULT CHARSET=utf8 PACK_KEYS=0 COMMENT='Spisok grupp';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_grouplist`
--

LOCK TABLES `users_grouplist` WRITE;
/*!40000 ALTER TABLE `users_grouplist` DISABLE KEYS */;
INSERT INTO `users_grouplist` VALUES (0,'anonymous','Группа незарегистрированных'),(1,'root','Группа администраторов'),(2,'operator','Группа операторов продаж'),(3,'sklad','Кладовщики'),(4,'buhgalter','Бухгалтерия, работа с банками, кассой'),(5,'content','Группа редакторов содержимого сайта'),(6,'viewer','Группа без прав проведения документов');
/*!40000 ALTER TABLE `users_grouplist` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_groups_acl`
--

DROP TABLE IF EXISTS `users_groups_acl`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_groups_acl` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `gid` int(11) NOT NULL,
  `object` varchar(64) NOT NULL,
  `action` varchar(16) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `gid` (`gid`),
  KEY `object` (`object`)
) ENGINE=InnoDB AUTO_INCREMENT=16311 DEFAULT CHARSET=latin1 COMMENT='Привилегии групп';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_groups_acl`
--

LOCK TABLES `users_groups_acl` WRITE;
/*!40000 ALTER TABLE `users_groups_acl` DISABLE KEYS */;
INSERT INTO `users_groups_acl` VALUES (173,0,'generic_articles','view'),(174,0,'generic_galery','view'),(175,0,'generic_news','view'),(11906,6,'doc_list','view'),(11907,6,'doc_postuplenie','view'),(11908,6,'doc_predlojenie','view'),(11909,6,'generic_articles','view'),(11910,6,'generic_galery','view'),(11911,6,'generic_news','view'),(11912,6,'list_sklad','view'),(12898,3,'doc_list','view'),(12899,3,'doc_peremeshenie','view'),(12900,3,'doc_peremeshenie','edit'),(12901,3,'doc_peremeshenie','create'),(12902,3,'doc_peremeshenie','apply'),(12903,3,'doc_postuplenie','view'),(12904,3,'doc_postuplenie','edit'),(12905,3,'doc_postuplenie','create'),(12906,3,'doc_postuplenie','apply'),(12907,3,'doc_predlojenie','view'),(12908,3,'doc_predlojenie','edit'),(12909,3,'doc_predlojenie','create'),(12910,3,'doc_predlojenie','apply'),(12911,3,'doc_predlojenie','cancel'),(12912,3,'doc_predlojenie','today_cancel'),(12913,3,'doc_realizaciya','view'),(12914,3,'doc_realizaciya','edit'),(12915,3,'doc_realizaciya','create'),(12916,3,'doc_realiz_bonus','view'),(12917,3,'doc_realiz_bonus','edit'),(12918,3,'doc_realiz_op','view'),(12919,3,'doc_sborka','view'),(12920,3,'doc_sborka','edit'),(12921,3,'doc_sborka','create'),(12922,3,'doc_sborka','apply'),(12923,3,'doc_service','view'),(12924,3,'doc_v_puti','view'),(12925,3,'doc_v_puti','edit'),(12926,3,'doc_v_puti','create'),(12927,3,'doc_v_puti','apply'),(12928,3,'doc_v_puti','cancel'),(12929,3,'doc_v_puti','today_cancel'),(12930,3,'doc_zayavka','view'),(12931,3,'doc_zsbor','view'),(12932,3,'generic_articles','view'),(12933,3,'generic_articles','edit'),(12934,3,'generic_articles','create'),(12935,3,'generic_galery','view'),(12936,3,'generic_news','view'),(12937,3,'generic_news','edit'),(12938,3,'generic_news','create'),(12939,3,'generic_price_an','view'),(12940,3,'list_agent','view'),(12941,3,'list_agent','edit'),(12942,3,'list_agent','create'),(12943,3,'list_agent_dov','view'),(12944,3,'list_agent_dov','create'),(12945,3,'list_price_an','view'),(12946,3,'list_price_an','edit'),(12947,3,'list_price_an','create'),(12948,3,'list_price_an','delete'),(12949,3,'list_sklad','view'),(12950,3,'list_sklad','edit'),(12951,3,'list_sklad','create'),(12952,3,'log_access','view'),(12953,3,'log_browser','view'),(12954,3,'log_call_request','view'),(12955,3,'report_costs','view'),(12956,3,'report_images','view'),(12957,3,'report_mincnt','view'),(12958,3,'report_ostatkinadatu','view'),(12959,3,'report_pos_nosells','view'),(12960,3,'report_reserve','view'),(12961,3,'report_sales','view'),(12962,3,'report_store','view'),(12963,3,'sys_ip-blacklist','view'),(12964,3,'sys_ip-blacklist','create'),(12965,3,'sys_ip-blacklist','delete'),(12966,3,'sys_ip-log','view'),(12967,3,'sys_ps-stat','view'),(13287,5,'doc_list','view'),(13288,5,'doc_service','view'),(13289,5,'generic_articles','view'),(13290,5,'generic_articles','edit'),(13291,5,'generic_articles','create'),(13292,5,'generic_articles','delete'),(13293,5,'generic_galery','view'),(13294,5,'generic_galery','edit'),(13295,5,'generic_galery','create'),(13296,5,'generic_galery','delete'),(13297,5,'generic_news','view'),(13298,5,'generic_news','edit'),(13299,5,'generic_news','create'),(13300,5,'generic_news','delete'),(13301,5,'list_sklad','view'),(13302,5,'list_sklad','edit'),(13303,5,'list_sklad','create'),(13304,5,'log_access','view'),(13305,5,'log_browser','view'),(13306,5,'log_error','view'),(13307,5,'report_images','view'),(13308,5,'report_liquidity','view'),(13309,5,'report_mincnt','view'),(13310,5,'report_noimg','view'),(13311,5,'report_ostatkinadatu','view'),(13312,5,'report_store','view'),(13313,5,'sys_async_task','view'),(13314,5,'sys_ps-stat','view'),(15601,1,'admin_comments','view'),(15602,1,'admin_comments','edit'),(15603,1,'admin_comments','delete'),(15604,1,'admin_users','view'),(15605,1,'admin_users','edit'),(15606,1,'admin_users','delete'),(15607,1,'doc_agent_ext','view'),(15608,1,'doc_agent_ext','edit'),(15609,1,'doc_dogovor','view'),(15610,1,'doc_dogovor','edit'),(15611,1,'doc_dogovor','delete'),(15612,1,'doc_dogovor','create'),(15613,1,'doc_dogovor','apply'),(15614,1,'doc_dogovor','cancel'),(15615,1,'doc_dogovor','forcecancel'),(15616,1,'doc_dogovor','today_cancel'),(15617,1,'doc_doveren','view'),(15618,1,'doc_doveren','edit'),(15619,1,'doc_doveren','delete'),(15620,1,'doc_doveren','create'),(15621,1,'doc_doveren','apply'),(15622,1,'doc_doveren','cancel'),(15623,1,'doc_doveren','forcecancel'),(15624,1,'doc_doveren','today_cancel'),(15625,1,'doc_factory','view'),(15626,1,'doc_factory','edit'),(15627,1,'doc_kompredl','view'),(15628,1,'doc_kompredl','edit'),(15629,1,'doc_kompredl','delete'),(15630,1,'doc_kompredl','create'),(15631,1,'doc_kompredl','apply'),(15632,1,'doc_kompredl','cancel'),(15633,1,'doc_kompredl','forcecancel'),(15634,1,'doc_kompredl','today_cancel'),(15635,1,'doc_korbonus','view'),(15636,1,'doc_korbonus','edit'),(15637,1,'doc_korbonus','delete'),(15638,1,'doc_korbonus','create'),(15639,1,'doc_korbonus','apply'),(15640,1,'doc_korbonus','cancel'),(15641,1,'doc_korbonus','forcecancel'),(15642,1,'doc_korbonus','today_cancel'),(15643,1,'doc_list','view'),(15644,1,'doc_list','delete'),(15645,1,'doc_pbank','view'),(15646,1,'doc_pbank','edit'),(15647,1,'doc_pbank','delete'),(15648,1,'doc_pbank','create'),(15649,1,'doc_pbank','apply'),(15650,1,'doc_pbank','cancel'),(15651,1,'doc_pbank','forcecancel'),(15652,1,'doc_pbank','today_cancel'),(15653,1,'doc_peremeshenie','view'),(15654,1,'doc_peremeshenie','edit'),(15655,1,'doc_peremeshenie','delete'),(15656,1,'doc_peremeshenie','create'),(15657,1,'doc_peremeshenie','apply'),(15658,1,'doc_peremeshenie','cancel'),(15659,1,'doc_peremeshenie','forcecancel'),(15660,1,'doc_peremeshenie','today_cancel'),(15661,1,'doc_perkas','view'),(15662,1,'doc_perkas','edit'),(15663,1,'doc_perkas','delete'),(15664,1,'doc_perkas','create'),(15665,1,'doc_perkas','apply'),(15666,1,'doc_perkas','cancel'),(15667,1,'doc_perkas','forcecancel'),(15668,1,'doc_perkas','today_cancel'),(15669,1,'doc_pko','view'),(15670,1,'doc_pko','edit'),(15671,1,'doc_pko','delete'),(15672,1,'doc_pko','create'),(15673,1,'doc_pko','apply'),(15674,1,'doc_pko','cancel'),(15675,1,'doc_pko','forcecancel'),(15676,1,'doc_pko','today_cancel'),(15677,1,'doc_postuplenie','view'),(15678,1,'doc_postuplenie','edit'),(15679,1,'doc_postuplenie','delete'),(15680,1,'doc_postuplenie','create'),(15681,1,'doc_postuplenie','apply'),(15682,1,'doc_postuplenie','cancel'),(15683,1,'doc_postuplenie','forcecancel'),(15684,1,'doc_postuplenie','today_cancel'),(15685,1,'doc_predlojenie','view'),(15686,1,'doc_predlojenie','edit'),(15687,1,'doc_predlojenie','delete'),(15688,1,'doc_predlojenie','create'),(15689,1,'doc_predlojenie','apply'),(15690,1,'doc_predlojenie','cancel'),(15691,1,'doc_predlojenie','forcecancel'),(15692,1,'doc_predlojenie','today_cancel'),(15693,1,'doc_rbank','view'),(15694,1,'doc_rbank','edit'),(15695,1,'doc_rbank','delete'),(15696,1,'doc_rbank','create'),(15697,1,'doc_rbank','apply'),(15698,1,'doc_rbank','cancel'),(15699,1,'doc_rbank','forcecancel'),(15700,1,'doc_rbank','today_cancel'),(15701,1,'doc_realizaciya','view'),(15702,1,'doc_realizaciya','edit'),(15703,1,'doc_realizaciya','delete'),(15704,1,'doc_realizaciya','create'),(15705,1,'doc_realizaciya','apply'),(15706,1,'doc_realizaciya','cancel'),(15707,1,'doc_realizaciya','forcecancel'),(15708,1,'doc_realizaciya','today_cancel'),(15709,1,'doc_realiz_bonus','view'),(15710,1,'doc_realiz_bonus','edit'),(15711,1,'doc_realiz_bonus','delete'),(15712,1,'doc_realiz_bonus','create'),(15713,1,'doc_realiz_bonus','apply'),(15714,1,'doc_realiz_bonus','cancel'),(15715,1,'doc_realiz_bonus','forcecancel'),(15716,1,'doc_realiz_bonus','today_cancel'),(15717,1,'doc_realiz_op','view'),(15718,1,'doc_realiz_op','edit'),(15719,1,'doc_realiz_op','delete'),(15720,1,'doc_realiz_op','create'),(15721,1,'doc_realiz_op','apply'),(15722,1,'doc_realiz_op','cancel'),(15723,1,'doc_realiz_op','forcecancel'),(15724,1,'doc_realiz_op','today_cancel'),(15725,1,'doc_reports','view'),(15726,1,'doc_reports','exec'),(15727,1,'doc_rko','view'),(15728,1,'doc_rko','edit'),(15729,1,'doc_rko','delete'),(15730,1,'doc_rko','create'),(15731,1,'doc_rko','apply'),(15732,1,'doc_rko','cancel'),(15733,1,'doc_rko','forcecancel'),(15734,1,'doc_rko','today_cancel'),(15735,1,'doc_sborka','view'),(15736,1,'doc_sborka','edit'),(15737,1,'doc_sborka','delete'),(15738,1,'doc_sborka','create'),(15739,1,'doc_sborka','apply'),(15740,1,'doc_sborka','cancel'),(15741,1,'doc_sborka','forcecancel'),(15742,1,'doc_sborka','today_cancel'),(15743,1,'doc_scripts','view'),(15744,1,'doc_scripts','exec'),(15745,1,'doc_service','view'),(15746,1,'doc_service','edit'),(15747,1,'doc_service','delete'),(15748,1,'doc_specific','view'),(15749,1,'doc_specific','edit'),(15750,1,'doc_specific','delete'),(15751,1,'doc_specific','create'),(15752,1,'doc_specific','apply'),(15753,1,'doc_specific','cancel'),(15754,1,'doc_specific','forcecancel'),(15755,1,'doc_specific','today_cancel'),(15756,1,'doc_v_puti','view'),(15757,1,'doc_v_puti','edit'),(15758,1,'doc_v_puti','delete'),(15759,1,'doc_v_puti','create'),(15760,1,'doc_v_puti','apply'),(15761,1,'doc_v_puti','cancel'),(15762,1,'doc_v_puti','forcecancel'),(15763,1,'doc_v_puti','today_cancel'),(15764,1,'doc_zayavka','view'),(15765,1,'doc_zayavka','edit'),(15766,1,'doc_zayavka','delete'),(15767,1,'doc_zayavka','create'),(15768,1,'doc_zayavka','apply'),(15769,1,'doc_zayavka','cancel'),(15770,1,'doc_zayavka','forcecancel'),(15771,1,'doc_zayavka','today_cancel'),(15772,1,'doc_zsbor','view'),(15773,1,'doc_zsbor','edit'),(15774,1,'doc_zsbor','delete'),(15775,1,'doc_zsbor','create'),(15776,1,'doc_zsbor','apply'),(15777,1,'doc_zsbor','cancel'),(15778,1,'doc_zsbor','forcecancel'),(15779,1,'doc_zsbor','today_cancel'),(15780,1,'generic_articles','view'),(15781,1,'generic_articles','edit'),(15782,1,'generic_articles','delete'),(15783,1,'generic_articles','create'),(15784,1,'generic_galery','view'),(15785,1,'generic_galery','edit'),(15786,1,'generic_galery','delete'),(15787,1,'generic_galery','create'),(15788,1,'generic_news','view'),(15789,1,'generic_news','edit'),(15790,1,'generic_news','delete'),(15791,1,'generic_news','create'),(15792,1,'generic_price_an','view'),(15793,1,'generic_tickets','view'),(15794,1,'generic_tickets','edit'),(15795,1,'generic_tickets','create'),(15796,1,'generic_tickets','redirect'),(15797,1,'list_agent','view'),(15798,1,'list_agent','edit'),(15799,1,'list_agent','create'),(15800,1,'list_agent_dov','view'),(15801,1,'list_agent_dov','edit'),(15802,1,'list_agent_dov','create'),(15803,1,'list_price_an','view'),(15804,1,'list_price_an','edit'),(15805,1,'list_price_an','delete'),(15806,1,'list_price_an','create'),(15807,1,'list_sklad','view'),(15808,1,'list_sklad','edit'),(15809,1,'list_sklad','create'),(15810,1,'log_access','view'),(15811,1,'log_browser','view'),(15812,1,'log_call_request','view'),(15813,1,'log_call_request','edit'),(15814,1,'log_error','view'),(15815,1,'report_agent','view'),(15816,1,'report_agent_nosells','view'),(15817,1,'report_apay','view'),(15818,1,'report_balance','view'),(15819,1,'report_bankday','view'),(15820,1,'report_cash','view'),(15821,1,'report_cons_finance','view'),(15822,1,'report_costs','view'),(15823,1,'report_dolgi','view'),(15824,1,'report_groupstore','view'),(15825,1,'report_images','view'),(15826,1,'report_incost','view'),(15827,1,'report_kassday','view'),(15828,1,'report_kladovshik','view'),(15829,1,'report_komplekt_zp','view'),(15830,1,'report_liquidity','view'),(15831,1,'report_mincnt','view'),(15832,1,'report_noimg','view'),(15833,1,'report_ostatkinadatu','view'),(15834,1,'report_outlay_items','view'),(15835,1,'report_payments','view'),(15836,1,'report_pos_komplekt','view'),(15837,1,'report_pos_nosells','view'),(15838,1,'report_pricetags','view'),(15839,1,'report_reserve','view'),(15840,1,'report_revision_act','view'),(15841,1,'report_sales','view'),(15842,1,'report_store','view'),(15843,1,'report_ved_agentov','view'),(15844,1,'sys_acl','view'),(15845,1,'sys_acl','edit'),(15846,1,'sys_acl','delete'),(15847,1,'sys_async_task','view'),(15848,1,'sys_async_task','exec'),(15849,1,'sys_ip-blacklist','view'),(15850,1,'sys_ip-blacklist','delete'),(15851,1,'sys_ip-blacklist','create'),(15852,1,'sys_ip-log','view'),(15853,1,'sys_ps-stat','view'),(15998,4,'doc_dogovor','view'),(15999,4,'doc_dogovor','edit'),(16000,4,'doc_dogovor','create'),(16001,4,'doc_dogovor','apply'),(16002,4,'doc_dogovor','cancel'),(16003,4,'doc_dogovor','today_cancel'),(16004,4,'doc_dogovor','today_apply'),(16005,4,'doc_doveren','view'),(16006,4,'doc_doveren','edit'),(16007,4,'doc_doveren','create'),(16008,4,'doc_doveren','apply'),(16009,4,'doc_doveren','cancel'),(16010,4,'doc_doveren','today_cancel'),(16011,4,'doc_doveren','today_apply'),(16012,4,'doc_factory','view'),(16013,4,'doc_kompredl','view'),(16014,4,'doc_kompredl','edit'),(16015,4,'doc_kompredl','create'),(16016,4,'doc_kompredl','apply'),(16017,4,'doc_kompredl','today_cancel'),(16018,4,'doc_korbonus','view'),(16019,4,'doc_list','view'),(16020,4,'doc_list','delete'),(16021,4,'doc_pbank','view'),(16022,4,'doc_pbank','edit'),(16023,4,'doc_pbank','delete'),(16024,4,'doc_pbank','create'),(16025,4,'doc_pbank','apply'),(16026,4,'doc_pbank','cancel'),(16027,4,'doc_pbank','today_cancel'),(16028,4,'doc_peremeshenie','view'),(16029,4,'doc_perkas','view'),(16030,4,'doc_perkas','edit'),(16031,4,'doc_perkas','create'),(16032,4,'doc_perkas','apply'),(16033,4,'doc_perkas','today_cancel'),(16034,4,'doc_pko','view'),(16035,4,'doc_pko','edit'),(16036,4,'doc_pko','delete'),(16037,4,'doc_pko','create'),(16038,4,'doc_pko','apply'),(16039,4,'doc_pko','cancel'),(16040,4,'doc_pko','today_cancel'),(16041,4,'doc_pko','today_apply'),(16042,4,'doc_postuplenie','view'),(16043,4,'doc_postuplenie','edit'),(16044,4,'doc_postuplenie','create'),(16045,4,'doc_postuplenie','apply'),(16046,4,'doc_postuplenie','today_cancel'),(16047,4,'doc_predlojenie','view'),(16048,4,'doc_predlojenie','edit'),(16049,4,'doc_predlojenie','create'),(16050,4,'doc_predlojenie','apply'),(16051,4,'doc_predlojenie','today_cancel'),(16052,4,'doc_rbank','view'),(16053,4,'doc_rbank','edit'),(16054,4,'doc_rbank','delete'),(16055,4,'doc_rbank','create'),(16056,4,'doc_rbank','apply'),(16057,4,'doc_rbank','cancel'),(16058,4,'doc_rbank','today_cancel'),(16059,4,'doc_realizaciya','view'),(16060,4,'doc_realizaciya','edit'),(16061,4,'doc_realizaciya','create'),(16062,4,'doc_realizaciya','apply'),(16063,4,'doc_realizaciya','today_cancel'),(16064,4,'doc_realiz_op','view'),(16065,4,'doc_realiz_op','edit'),(16066,4,'doc_realiz_op','create'),(16067,4,'doc_realiz_op','apply'),(16068,4,'doc_realiz_op','today_cancel'),(16069,4,'doc_reports','view'),(16070,4,'doc_reports','exec'),(16071,4,'doc_rko','view'),(16072,4,'doc_rko','edit'),(16073,4,'doc_rko','create'),(16074,4,'doc_rko','apply'),(16075,4,'doc_rko','cancel'),(16076,4,'doc_rko','today_cancel'),(16077,4,'doc_rko','today_apply'),(16078,4,'doc_sborka','view'),(16079,4,'doc_sborka','edit'),(16080,4,'doc_sborka','create'),(16081,4,'doc_sborka','apply'),(16082,4,'doc_sborka','today_cancel'),(16083,4,'doc_scripts','view'),(16084,4,'doc_service','view'),(16085,4,'doc_specific','view'),(16086,4,'doc_specific','edit'),(16087,4,'doc_specific','create'),(16088,4,'doc_specific','apply'),(16089,4,'doc_specific','today_cancel'),(16090,4,'doc_v_puti','view'),(16091,4,'doc_v_puti','edit'),(16092,4,'doc_v_puti','create'),(16093,4,'doc_v_puti','apply'),(16094,4,'doc_v_puti','cancel'),(16095,4,'doc_v_puti','today_cancel'),(16096,4,'doc_zayavka','view'),(16097,4,'doc_zayavka','edit'),(16098,4,'doc_zayavka','create'),(16099,4,'doc_zayavka','apply'),(16100,4,'doc_zayavka','today_cancel'),(16101,4,'generic_articles','view'),(16102,4,'generic_articles','edit'),(16103,4,'generic_articles','create'),(16104,4,'generic_galery','view'),(16105,4,'generic_galery','edit'),(16106,4,'generic_galery','create'),(16107,4,'generic_news','view'),(16108,4,'generic_news','edit'),(16109,4,'generic_news','create'),(16110,4,'generic_price_an','view'),(16111,4,'generic_tickets','view'),(16112,4,'generic_tickets','edit'),(16113,4,'generic_tickets','create'),(16114,4,'list_agent','view'),(16115,4,'list_agent','edit'),(16116,4,'list_agent','create'),(16117,4,'list_agent_dov','view'),(16118,4,'list_agent_dov','edit'),(16119,4,'list_agent_dov','create'),(16120,4,'list_price_an','view'),(16121,4,'list_price_an','edit'),(16122,4,'list_price_an','create'),(16123,4,'list_sklad','view'),(16124,4,'list_sklad','edit'),(16125,4,'list_sklad','create'),(16126,4,'log_access','view'),(16127,4,'log_browser','view'),(16128,4,'log_call_request','view'),(16129,4,'log_call_request','edit'),(16130,4,'log_error','view'),(16131,4,'report_agent','view'),(16132,4,'report_agent_nosells','view'),(16133,4,'report_apay','view'),(16134,4,'report_balance','view'),(16135,4,'report_bankday','view'),(16136,4,'report_cash','view'),(16137,4,'report_cons_finance','view'),(16138,4,'report_costs','view'),(16139,4,'report_dolgi','view'),(16140,4,'report_images','view'),(16141,4,'report_incost','view'),(16142,4,'report_kassday','view'),(16143,4,'report_kladovshik','view'),(16144,4,'report_komplekt_zp','view'),(16145,4,'report_liquidity','view'),(16146,4,'report_mincnt','view'),(16147,4,'report_ostatkinadatu','view'),(16148,4,'report_outlay_items','view'),(16149,4,'report_payments','view'),(16150,4,'report_pos_komplekt','view'),(16151,4,'report_pos_nosells','view'),(16152,4,'report_pricetags','view'),(16153,4,'report_reserve','view'),(16154,4,'report_revision_act','view'),(16155,4,'report_sales','view'),(16156,4,'report_store','view'),(16157,4,'report_ved_agentov','view'),(16158,4,'sys_acl','view'),(16159,4,'sys_async_task','view'),(16160,4,'sys_async_task','exec'),(16161,4,'sys_ip-blacklist','view'),(16162,4,'sys_ip-log','view'),(16163,4,'sys_ps-stat','view'),(16164,2,'admin_comments','view'),(16165,2,'admin_comments','edit'),(16166,2,'admin_users','view'),(16167,2,'doc_agent_ext','view'),(16168,2,'doc_agent_ext','edit'),(16169,2,'doc_dogovor','view'),(16170,2,'doc_dogovor','edit'),(16171,2,'doc_dogovor','create'),(16172,2,'doc_dogovor','today_cancel'),(16173,2,'doc_dogovor','today_apply'),(16174,2,'doc_doveren','view'),(16175,2,'doc_doveren','edit'),(16176,2,'doc_doveren','create'),(16177,2,'doc_doveren','apply'),(16178,2,'doc_doveren','today_cancel'),(16179,2,'doc_doveren','today_apply'),(16180,2,'doc_factory','view'),(16181,2,'doc_kompredl','view'),(16182,2,'doc_kompredl','edit'),(16183,2,'doc_kompredl','create'),(16184,2,'doc_kompredl','apply'),(16185,2,'doc_kompredl','cancel'),(16186,2,'doc_kompredl','today_cancel'),(16187,2,'doc_kompredl','today_apply'),(16188,2,'doc_korbonus','view'),(16189,2,'doc_korbonus','edit'),(16190,2,'doc_korbonus','create'),(16191,2,'doc_korbonus','apply'),(16192,2,'doc_korbonus','today_cancel'),(16193,2,'doc_korbonus','today_apply'),(16194,2,'doc_list','view'),(16195,2,'doc_pbank','view'),(16196,2,'doc_peremeshenie','view'),(16197,2,'doc_perkas','view'),(16198,2,'doc_pko','view'),(16199,2,'doc_postuplenie','view'),(16200,2,'doc_predlojenie','view'),(16201,2,'doc_predlojenie','edit'),(16202,2,'doc_predlojenie','create'),(16203,2,'doc_predlojenie','apply'),(16204,2,'doc_predlojenie','today_apply'),(16205,2,'doc_rbank','view'),(16206,2,'doc_realizaciya','view'),(16207,2,'doc_realizaciya','edit'),(16208,2,'doc_realizaciya','create'),(16209,2,'doc_realizaciya','apply'),(16210,2,'doc_realizaciya','cancel'),(16211,2,'doc_realizaciya','today_cancel'),(16212,2,'doc_realizaciya','today_apply'),(16213,2,'doc_realiz_bonus','view'),(16214,2,'doc_realiz_bonus','edit'),(16215,2,'doc_realiz_op','view'),(16216,2,'doc_reports','view'),(16217,2,'doc_rko','view'),(16218,2,'doc_rko','edit'),(16219,2,'doc_rko','create'),(16220,2,'doc_rko','today_cancel'),(16221,2,'doc_rko','today_apply'),(16222,2,'doc_sborka','view'),(16223,2,'doc_sborka','edit'),(16224,2,'doc_sborka','create'),(16225,2,'doc_sborka','today_cancel'),(16226,2,'doc_sborka','today_apply'),(16227,2,'doc_scripts','view'),(16228,2,'doc_scripts','exec'),(16229,2,'doc_specific','view'),(16230,2,'doc_specific','edit'),(16231,2,'doc_specific','create'),(16232,2,'doc_specific','apply'),(16233,2,'doc_specific','cancel'),(16234,2,'doc_specific','today_cancel'),(16235,2,'doc_specific','today_apply'),(16236,2,'doc_v_puti','view'),(16237,2,'doc_v_puti','edit'),(16238,2,'doc_v_puti','create'),(16239,2,'doc_v_puti','apply'),(16240,2,'doc_v_puti','cancel'),(16241,2,'doc_v_puti','today_cancel'),(16242,2,'doc_v_puti','today_apply'),(16243,2,'doc_zayavka','view'),(16244,2,'doc_zayavka','edit'),(16245,2,'doc_zayavka','create'),(16246,2,'doc_zayavka','apply'),(16247,2,'doc_zayavka','cancel'),(16248,2,'doc_zayavka','today_cancel'),(16249,2,'doc_zayavka','today_apply'),(16250,2,'doc_zsbor','view'),(16251,2,'generic_articles','view'),(16252,2,'generic_articles','edit'),(16253,2,'generic_articles','create'),(16254,2,'generic_galery','view'),(16255,2,'generic_galery','edit'),(16256,2,'generic_galery','create'),(16257,2,'generic_news','view'),(16258,2,'generic_news','edit'),(16259,2,'generic_news','create'),(16260,2,'generic_price_an','view'),(16261,2,'generic_tickets','view'),(16262,2,'generic_tickets','edit'),(16263,2,'generic_tickets','create'),(16264,2,'generic_tickets','redirect'),(16265,2,'list_agent','view'),(16266,2,'list_agent','edit'),(16267,2,'list_agent','create'),(16268,2,'list_agent_dov','view'),(16269,2,'list_agent_dov','edit'),(16270,2,'list_agent_dov','create'),(16271,2,'list_price_an','view'),(16272,2,'list_price_an','edit'),(16273,2,'list_price_an','delete'),(16274,2,'list_price_an','create'),(16275,2,'list_sklad','view'),(16276,2,'list_sklad','edit'),(16277,2,'list_sklad','create'),(16278,2,'log_access','view'),(16279,2,'log_browser','view'),(16280,2,'log_call_request','view'),(16281,2,'log_call_request','edit'),(16282,2,'log_error','view'),(16283,2,'report_agent','view'),(16284,2,'report_agent_nosells','view'),(16285,2,'report_apay','view'),(16286,2,'report_balance','view'),(16287,2,'report_cash','view'),(16288,2,'report_costs','view'),(16289,2,'report_dolgi','view'),(16290,2,'report_images','view'),(16291,2,'report_kassday','view'),(16292,2,'report_kladovshik','view'),(16293,2,'report_komplekt_zp','view'),(16294,2,'report_liquidity','view'),(16295,2,'report_mincnt','view'),(16296,2,'report_ostatkinadatu','view'),(16297,2,'report_payments','view'),(16298,2,'report_pos_komplekt','view'),(16299,2,'report_pos_nosells','view'),(16300,2,'report_pricetags','view'),(16301,2,'report_reserve','view'),(16302,2,'report_revision_act','view'),(16303,2,'report_sales','view'),(16304,2,'report_store','view'),(16305,2,'report_ved_agentov','view'),(16306,2,'sys_async_task','view'),(16307,2,'sys_async_task','exec'),(16308,2,'sys_ip-blacklist','view'),(16309,2,'sys_ip-log','view'),(16310,2,'sys_ps-stat','view');
/*!40000 ALTER TABLE `users_groups_acl` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_in_group`
--

DROP TABLE IF EXISTS `users_in_group`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_in_group` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `uid` int(11) NOT NULL,
  `gid` int(11) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `uid` (`uid`),
  KEY `gid` (`gid`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COMMENT='Соответствие групп и пользователей';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_in_group`
--

LOCK TABLES `users_in_group` WRITE;
/*!40000 ALTER TABLE `users_in_group` DISABLE KEYS */;
/*!40000 ALTER TABLE `users_in_group` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_login_history`
--

DROP TABLE IF EXISTS `users_login_history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_login_history` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `date` datetime NOT NULL,
  `ip` varchar(32) NOT NULL,
  `useragent` varchar(128) NOT NULL,
  `method` varchar(8) NOT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_login_history`
--

LOCK TABLES `users_login_history` WRITE;
/*!40000 ALTER TABLE `users_login_history` DISABLE KEYS */;
/*!40000 ALTER TABLE `users_login_history` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_objects`
--

DROP TABLE IF EXISTS `users_objects`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_objects` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `object` varchar(32) NOT NULL,
  `desc` varchar(128) NOT NULL,
  `actions` varchar(128) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `object` (`object`)
) ENGINE=InnoDB AUTO_INCREMENT=89 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_objects`
--

LOCK TABLES `users_objects` WRITE;
/*!40000 ALTER TABLE `users_objects` DISABLE KEYS */;
INSERT INTO `users_objects` VALUES (1,'doc','Документы',''),(2,'doc_list','Журнал документов','view,delete'),(3,'doc_postuplenie','Поступление','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(4,'generic_articles','Доступ к статьям','view,edit,create,delete'),(5,'sys','Системные объекты',''),(6,'generic','Общие объекты',''),(7,'sys_acl','Управление привилегиями','view,edit,delete'),(8,'doc_realizaciya','Реализация','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(9,'doc_zayavka','Документ заявки','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(10,'doc_kompredl','Коммерческое предложение','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(11,'doc_dogovor','Договор','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(12,'doc_doveren','Доверенность','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(13,'doc_pbank','Приход средств в банк','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(14,'doc_peremeshenie','Перемещение товара','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(15,'doc_perkas','Перемещение средств в кассе','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(16,'doc_predlojenie','Предложение поставщика','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(17,'doc_rbank','Расход средств из банка','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(18,'doc_realiz_op','Оперативная реализация','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(19,'doc_rko','Расходный кассовый ордер','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(20,'doc_sborka','Сборка изделия','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(21,'doc_specific','Спецификация','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(22,'doc_v_puti','Товар в пути','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(23,'list','Списки',''),(24,'list_agent','Агенты','create,edit,view'),(25,'list_sklad','Склад','create,edit,view'),(26,'list_price_an','Анализатор прайсов','create,edit,view,delete'),(27,'list_agent_dov','Доверенные лица','create,edit,view'),(28,'report','Отчёты',''),(29,'report_cash','Кассовый отчёт','view'),(30,'generic_news','Новости','view,create,edit,delete'),(31,'doc_service','Служебные функции','view,edit,delete'),(32,'doc_scripts','Сценарии и операции','view,exec'),(33,'log','Системные журналы',''),(34,'log_browser','Статистирка броузеров','view'),(35,'log_error','Журнал ошибок','view'),(36,'log_access','Журнал посещений','view'),(37,'sys_async_task','Ассинхронные задачи','view,exec'),(38,'sys_ip-blacklist','Чёрный список IP адресов','view,create,delete'),(39,'sys_ip-log','Журнал обращений к ip адресам','view'),(40,'generic_price_an','Анализатор прайсов','view'),(41,'generic_galery','Фотогалерея','view,create,edit,delete'),(42,'doc_pko','Приходный кассовый ордер','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(43,'doc_reports','Доступ к отчётам','view,exec'),(44,'generic_tickets','Планировщик задач','view,edit,create,redirect'),(45,'sys_ps-stat','Статистика переходов с поисковиков','view'),(48,'report_dolgi','Отчёт по задолженностям','view'),(49,'report_pos_nosells','Отчёт по номенклатуре без продаж','view'),(50,'report_store','Остатки на складе','view'),(51,'report_payments','Отчёт по проплатам','view'),(52,'report_agent_nosells','Отчёт по агентам без продаж','view'),(53,'report_agent','Отчёт по агенту','view'),(54,'report_ostatkinadatu','Отчёт по остаткам на складе на выбранную дату','view'),(55,'report_cons_finance','Сводный финансовый','view'),(56,'report_images','Отчёт по изображениям складских наименований','view'),(57,'report_sales','Отчёт по движению товара','view'),(58,'report_pricetags','Ценники','view'),(59,'report_komplekt_zp','Отчёт по комплектующим с зарплатой','view'),(60,'report_bankday','Отчёт по банку','view'),(62,'report_costs','Отчёт по ценам','view'),(63,'report_revision_act','Акт сверки','view'),(64,'report_balance','Состояние счетов и касс','view'),(65,'report_kladovshik','Отчёт по кладовщикам в реализациях','view'),(66,'report_kassday','Кассовый отчёт за день','view'),(67,'report_apay','Отчёт по платежам агентов','view'),(68,'doc_factory','Учёт производства','view,edit'),(69,'report_mincnt','Отчёт по минимальному количеству','view'),(70,'report_pos_komplekt','Отчёт по остаткам комплектующих','view'),(71,'report_ved_agentov','Ведомость по агентам','view'),(72,'doc_korbonus','Корректировка бонусного баланса','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(73,'doc_realiz_bonus','Реализация за бонусы','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(74,'log_call_request','Журнал запрошенных звонков','view,edit'),(75,'report_outlay_items','Отчёт по статьям расходов','view'),(76,'doc_agent_ext','Доступ к административным полям агентов','view,edit'),(77,'report_reserve','Отчёт по резервам','view'),(78,'doc_zsbor','Заявка на сборку','view,edit,create,apply,cancel,forcecancel,delete,today_cancel,today_apply,printna'),(79,'report_liquidity','Отчет по ликвидности','view'),(80,'report_noimg','Отчёт по товарам без изображений','view'),(81,'report_groupstore','Отчёт с остатками по складам','view'),(82,'report_incost','Отчет по себестоимости','view'),(83,'admin_comments','Администрирование комментариев','view,edit,delete'),(84,'admin_users','Администрирование пользователей','view,edit,delete'),(85,'admin_mailconfig','Настройка почтовых ящиков и алиасов','view,create,edit,delete'),(86,'doc_factory_builders','Справочник сборщиков на производстве','view,create,edit,delete'),(87,'report_zayavki','Отчет по заявкам','view'),(88,'report_agent_resp','Отчет по агентам ответственного сотрудника','view');
/*!40000 ALTER TABLE `users_objects` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_openid`
--

DROP TABLE IF EXISTS `users_openid`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_openid` (
  `user_id` int(11) NOT NULL,
  `openid_identify` varchar(192) NOT NULL,
  `openid_type` int(16) NOT NULL,
  UNIQUE KEY `openid_identify` (`openid_identify`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `users_openid_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Привязка к openid';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_openid`
--

LOCK TABLES `users_openid` WRITE;
/*!40000 ALTER TABLE `users_openid` DISABLE KEYS */;
/*!40000 ALTER TABLE `users_openid` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_unsubscribe_log`
--

DROP TABLE IF EXISTS `users_unsubscribe_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_unsubscribe_log` (
  `email` varchar(64) NOT NULL,
  `phone` varchar(32) NOT NULL,
  `time` datetime NOT NULL,
  `source` varchar(32) NOT NULL,
  `is_user` int(11) NOT NULL,
  KEY `email` (`email`),
  KEY `phone` (`phone`),
  KEY `time` (`time`),
  KEY `source` (`source`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_unsubscribe_log`
--

LOCK TABLES `users_unsubscribe_log` WRITE;
/*!40000 ALTER TABLE `users_unsubscribe_log` DISABLE KEYS */;
/*!40000 ALTER TABLE `users_unsubscribe_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users_worker_info`
--

DROP TABLE IF EXISTS `users_worker_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users_worker_info` (
  `user_id` int(11) NOT NULL,
  `worker` tinyint(4) NOT NULL,
  `worker_email` varchar(64) NOT NULL,
  `worker_phone` varchar(16) NOT NULL,
  `worker_jid` varchar(32) NOT NULL,
  `worker_real_name` varchar(64) NOT NULL,
  `worker_real_address` varchar(256) NOT NULL,
  `worker_post_name` varchar(64) NOT NULL COMMENT 'Должность',
  UNIQUE KEY `user_id` (`user_id`),
  KEY `worker_email` (`worker_email`),
  KEY `worker_phone` (`worker_phone`),
  KEY `worker_jid` (`worker_jid`),
  CONSTRAINT `users_worker_info_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users_worker_info`
--

LOCK TABLES `users_worker_info` WRITE;
/*!40000 ALTER TABLE `users_worker_info` DISABLE KEYS */;
/*!40000 ALTER TABLE `users_worker_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `variables`
--

DROP TABLE IF EXISTS `variables`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `variables` (
  `corrupted` tinyint(4) NOT NULL COMMENT 'ÐŸÑ€Ð¸Ð·Ð½Ð°Ðº Ð½Ð°Ñ€ÑƒÑˆÐµÐ½Ð¸Ñ Ñ†ÐµÐ»Ð¾ÑÑ‚Ð½Ð¾ÑÑ‚Ð¸',
  `recalc_active` int(9) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `variables`
--

LOCK TABLES `variables` WRITE;
/*!40000 ALTER TABLE `variables` DISABLE KEYS */;
INSERT INTO `variables` VALUES (0,0);
/*!40000 ALTER TABLE `variables` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `votings`
--

DROP TABLE IF EXISTS `votings`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `votings` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(128) NOT NULL,
  `start_date` date NOT NULL,
  `end_date` date NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8 COMMENT='Голосования';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `votings`
--

LOCK TABLES `votings` WRITE;
/*!40000 ALTER TABLE `votings` DISABLE KEYS */;
/*!40000 ALTER TABLE `votings` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `votings_results`
--

DROP TABLE IF EXISTS `votings_results`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `votings_results` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `voting_id` int(11) NOT NULL,
  `variant_id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `ip_addr` varchar(32) NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uniq` (`voting_id`,`variant_id`,`user_id`,`ip_addr`),
  KEY `voting_id` (`voting_id`),
  KEY `vars_id` (`variant_id`),
  KEY `user_id` (`user_id`),
  KEY `ip_addr` (`ip_addr`),
  CONSTRAINT `votings_results_ibfk_1` FOREIGN KEY (`voting_id`) REFERENCES `votings` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `votings_results_ibfk_3` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE SET NULL ON UPDATE SET NULL,
  CONSTRAINT `votings_results_ibfk_4` FOREIGN KEY (`variant_id`) REFERENCES `votings_vars` (`variant_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='Голоса';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `votings_results`
--

LOCK TABLES `votings_results` WRITE;
/*!40000 ALTER TABLE `votings_results` DISABLE KEYS */;
/*!40000 ALTER TABLE `votings_results` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `votings_vars`
--

DROP TABLE IF EXISTS `votings_vars`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `votings_vars` (
  `voting_id` int(11) NOT NULL,
  `variant_id` int(11) NOT NULL,
  `text` varchar(128) NOT NULL,
  UNIQUE KEY `uni` (`voting_id`,`variant_id`),
  KEY `voting_id` (`voting_id`),
  KEY `variant_id` (`variant_id`),
  KEY `text` (`text`),
  CONSTRAINT `votings_vars_ibfk_1` FOREIGN KEY (`voting_id`) REFERENCES `votings` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `votings_vars`
--

LOCK TABLES `votings_vars` WRITE;
/*!40000 ALTER TABLE `votings_vars` DISABLE KEYS */;
/*!40000 ALTER TABLE `votings_vars` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `wikiphoto`
--

DROP TABLE IF EXISTS `wikiphoto`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `wikiphoto` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `ext` varchar(4) NOT NULL,
  `uid` int(11) NOT NULL DEFAULT '0',
  `comment` varchar(50) NOT NULL,
  UNIQUE KEY `id` (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `wikiphoto`
--

LOCK TABLES `wikiphoto` WRITE;
/*!40000 ALTER TABLE `wikiphoto` DISABLE KEYS */;
/*!40000 ALTER TABLE `wikiphoto` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'nskps'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2015-03-24 12:00:01
